# Journey North Adult Sightings

In [1]:
#  Import and read
import pandas as pd 
import numpy as np
import json
# Sue Mottet 2-19-2022

# geoJSONifier

In [2]:
def df_to_geojson(df, properties, lat='latitude', lon='longitude'):
    # create a new python dict to contain our geojson data, using geojson format
    geojson = {'type':'FeatureCollection', 'features':[]}

    # loop through each row in the dataframe and convert each row to geojson format
    for _, row in df.iterrows():
        # create a feature template to fill in
        feature = {'type':'Feature',
                   'properties':{},
                   'geometry':{'type':'Point',
                               'coordinates':[]}}

        # fill in the coordinates
        feature['geometry']['coordinates'] = [row[lon],row[lat]]

        # for each column, get the value and add it as a new feature property
        for prop in properties:
            feature['properties'][prop] = row[prop]
        
        # add this feature (aka, converted dataframe row) to the list of features inside our dict
        geojson['features'].append(feature)
    
    return geojson

# Load file

In [3]:
JNorth1996_2020_df = pd.read_csv("UWMadisonArb_JNorth_Project_MonarchsAndMilkweed_1996-2020.csv")
JNorth1996_2020_df.head()

C:\Users\motte\anaconda3\envs\mlenv\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,id,sighting_date,species,number,latitude,longitude,flag_location,comments,school,grade,image_url,customerid,number_old,flag_number,species_old,flag_species
0,850841703,1996-12-16,Monarch Adult Sighted,1,27.594,-81.362,0,On the ballfield a solitary monarch butterfly ...,Walker memorial junior academy,10.0,-999999.999,135,-999999.999,1,Monarch Butterfly,1
1,851824801,1996-12-06,Monarch Adult Sighted,1,30.420,-87.224,0,Our 5th grade Discovery students who went alon...,Hambrick elementary school,5.0,-999999.999,150,-999999.999,1,Monarch Butterfly,1
2,854409931,1996-09-21,Monarch Adult Sighted,1,40.817,-96.710,0,We saw several hundred monarchs in our school ...,-999999.999,5.0,-999999.999,9701054,-999999.999,1,Monarch Butterfly,1
3,854557206,1996-09-21,Monarch Adult Sighted,1,40.817,-96.710,0,Over a hundered monarchs in our school butterf...,Fredstrom elementary school,6.0,-999999.999,175,-999999.999,1,Monarch Butterfly,1
4,855061862,1997-01-01,Monarch Adult Sighted,1,34.244,-77.946,0,"I Thought I Saw It, But I Was Suprised To See ...",Gregory,3.0,-999999.999,181,-999999.999,1,Monarch Butterfly,1

# Data Exploratory

In [4]:
JNorth1996_2020_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227433 entries, 0 to 227432
Data columns (total 16 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             227433 non-null  int64
 1   sighting_date  227433 non-null  object
 2   species        227433 non-null  object
 3   number         227433 non-null  int64
 4   latitude       227433 non-null  float64
 5   longitude      227433 non-null  float64
 6   flag_location  227433 non-null  int64
 7   comments       227433 non-null  object
 8   school         227433 non-null  object
 9   grade          227433 non-null  float64
 10  image_url      227433 non-null  object
 11  customerid     227433 non-null  int64
 12  number_old     227433 non-null  float64
 13  flag_number    227433 non-null  int64
 14  species_old    227433 non-null  object
 15  flag_species   227433 non-null  int64
dtypes: float64(4), int64(6), object(6)
memory usage: 27.8+ MB

In [5]:
str(JNorth1996_2020_df.columns.tolist())

"['id', 'sighting_date', 'species', 'number', 'latitude', 'longitude', 'flag_location', 'comments', 'school', 'grade', 'image_url', 'customerid', 'number_old', 'flag_number', 'species_old', 'flag_species']"

In [6]:
JNorth1996_2020_df.describe()

,id,number,latitude,longitude,flag_location,grade,customerid,number_old,flag_number,flag_species
count,2.274330e+05,2.274330e+05,227433.000000,227433.000000,227433.000000,227433.000000,2.274330e+05,2.274330e+05,227433.000000,227433.000000
mean,1.420650e+09,1.186529e+02,38.400690,-87.569965,0.598018,-907386.217597,9.451737e+06,-2.844270e+05,0.294816,0.130324
std,1.456887e+08,2.209080e+04,5.268651,10.880362,0.490299,289894.342744,2.193961e+06,4.518136e+05,0.467089,0.336660
min,8.508417e+08,-1.700000e+01,-12.100000,-165.107000,0.000000,-999999.999000,0.000000e+00,-1.000000e+06,0.000000,0.000000
25%,1.377751e+09,1.000000e+00,34.723000,-95.268000,0.000000,-999999.999000,9.941050e+06,-1.000000e+06,0.000000,0.000000
50%,1.477448e+09,1.000000e+00,39.503000,-86.787000,1.000000,-999999.999000,9.977663e+06,1.000000e+00,0.000000,0.000000
75%,1.526383e+09,3.000000e+00,42.409000,-79.255000,1.000000,-999999.999000,1.000029e+07,3.000000e+00,1.000000,0.000000
max,1.526525e+09,1.000000e+07,65.136000,-52.883000,1.000000,1112.000000,1.004256e+07,1.000000e+07,2.000000,1.000000

In [7]:
JNorth1996_2020_df.columns.tolist()

['id',
 'sighting_date',
 'species',
 'number',
 'latitude',
 'longitude',
 'flag_location',
 'comments',
 'school',
 'grade',
 'image_url',
 'customerid',
 'number_old',
 'flag_number',
 'species_old',
 'flag_species']

In [8]:
JNorth1996_2020_df.shape

(227433, 16)

In [9]:
# Determine the number of unique values in each column.
for col in JNorth1996_2020_df:
  print(JNorth1996_2020_df[col].unique())

[ 850841703  851824801  854409931 ... 1526524404 1526524405 1526525021]
['1996-12-16' '1996-12-06' '1996-09-21' ... '2020-12-29' '2020-12-30'
 '2020-12-31']
['Monarch Adult Sighted' 'Monarch Adult (FIRST sighted)'
 'Monarch Egg (FIRST sighted)' 'Monarch (OTHER Observations)'
 'Monarch Larva (FIRST sighted)' 'Monarch PEAK Migration'
 'Milkweed (FIRST sighted)' 'Monarch Fall Roost' 'Monarch Egg Sighted'
 'Monarch Larva Sighted' 'Monarch, Captive-Reared' 'Milkweed Sighted']
[       1      150       20       89       30     2000       50     7500
       23      200        5      300        4      100       71      120
      325       21       28     5000    20000       36       25        6
       54     1000      160       24       60       37        2     3000
  1000000       10  2000000       40       85       65       15        8
      500       14      112       75       80    15000       18    10000
      912   100000      400      800       12       35      600       16
    25000     1500     1117       70        3      463       45       72
      250      182       56       26    30000     2500     8000      750
      700       46      556       34      275       53       22      650
      210      224     1100      240   200000      900     1200        7
       13      115       11       19      810       66       43      510
        9       62       27      290      104       44      440      202
       55      180       17      140      269       61      142      175
       41      123       32       76       31      195      125       29
      164      109      119      105     4000       69      360       88
       58      239       48      310      117       52      261       90
      135      296      211       39       51      102     7001      127
       49       47       33     1300       42      101     5075     1520
      170       81      190       38      110      558      381      228
      248       86       74      172      230      420     2806       94
       92      118      425     5400     6300       68       79    50000
     2300     7000       84      128       57      350       83      124
      114      450      147      501       87       77      197      840
    13460     3500       64       73      178      265      151      133
      121      477       59       97      850      130      165       95
      383       98      729      222      116      225       63     6000
      475    34000    13420    21329    12073    16244    30293    11082
       78      214      113      108      280      212      138      285
      229      216      720      206      606      287      107      134
      157      540 10000000      220      103      270       82      139
      318       93       67      181      122      158      156      232
      106      155     2400      667     1286      179      349      207
      505      132      154     1400    32914    29804    18128    15890
     7750     8531     7333     7783      173      213      126      378
      417      481      780     4800      625      208      205      145
      260      193      144      227      305      831      289      246
      404      152       96      373      855     1800      519      215
      441      337    23800      218      340      231     2100      550
     4500      320     9000    12000      324      461      184      570
      444      620    11000      870      478      252      447      247
      281      980    28073    13492    12864    11472    10200      301
      111      259      171      141      256      186      174      198
      479      187      223      474      203      278      153      257
      520      185     3200      375      258      136    70000    60200
    48000    17800      264    19755    17100    12189    13375      233
      204      192      131       -1      129      149      -17      460
      382      137      143      445       91     1700      330      254
      429      813     2200      316     2600      696      291      255
      286      543      183      251      362      226      453     1080
      860      315      332      244     1351    35000     1503     1125
      725     1482      593     2079    12284    19741    12360    10099
      587    19000   500000      189      671      713     1016      176
      345      219      234      249      409      418    16000     3900
      169     7200      272      284      653      428      348      777
      253       99      201     1516      335      359      356      875
      560      177      525      686     1380      276   999999    12620
     6500     5850      188     2960      480      385      827      323
      148     1012      465      196      162      238      446      313
     2385      307      263      357      163      495     1001      541
      733      167     3600      457     5700     1650     1120     3553
      995     1600     1390      614     7600     8250      314     1580
      221     1620      470      759      267      960     1301      566
      342      880      782      241      514     2250     2470      925
      403      166     6769      146     2469      209      279      868
      585      311      683      354      308      760      387      563
      801      536      161      397      322      613      191     1750
      199      516      321     1850      277      297     4750      370
      489     1149      268     2816      789      430      978      770
      493      716      159]
[27.594 30.42  40.817 ... 30.139 35.008 54.968]
[ -81.362  -87.224  -96.71  ... -118.107 -119.132 -108.727]
[0 1]
['On the ballfield a solitary monarch butterfly flew across the field in a south-west direction at approximately 1:30 pm.'
 'Our 5th grade Discovery students who went along on an overnight field trip to Ft. Pickens, Florida, noticed that there were monarch butterflies all over the grounds of the fort the day they were there (Dec. 6,1996).'
 'We saw several hundred monarchs in our school butterfly garden,  sipping nectar from the New England asters and zinnias.'
 ...
 "There have been at least three Monarchs in my yard this year. I know it's at least three, because I often see all of them at once. But there may be more. I have lived here for 35 years, and an additional 23 years just a mile-and-a-half down the road. This is the first time in decades that I've had Monarchs in my yard, and I've been very excited that they're coming back. I'm hoping to see more in the future. "
 'One larva seen.'
 'Date of last adult sighted.Total sightings were 98 adults from June 3 to Sept. 4.Peak sightings were July 8 to Aug 7.Approx. acreage with milkweed is equal to 4.5Ac. ']
['Walker memorial junior academy' 'Hambrick elementary school'
 '-999999.999' ... 'Homosassa springs wildlife state park'
 'Director, virginia master naturalist program' -999999.999]
[ 1.00000000e+01  5.00000000e+00  6.00000000e+00  3.00000000e+00
  9.00000000e+00 -9.99999999e+05  7.00000000e+00  2.00000000e+00
  8.00000000e+00  9.90000000e+01  4.00000000e+00  1.00000000e+00
  1.20000000e+01  1.10000000e+01  0.00000000e+00  3.40000000e+01
  2.50000000e+01  4.60000000e+01  6.80000000e+01  1.50000000e+01
  9.50000000e+01  3.60000000e+01  1.80000000e+01  2.30000000e+01
  1.40000000e+01  4.50000000e+01  9.12000000e+02  2.40000000e+01
  6.90000000e+01  5.60000000e+01  7.12000000e+02  6.78000000e+02
  1.12000000e+02  4.90000000e+01  7.80000000e+01  6.70000000e+01
  1.30000000e+01  4.56000000e+02  1.90000000e+01  6.12000000e+02
  1.11200000e+03  1.60000000e+01  1.01200000e+03  3.80000000e+01
  6.30000000e+01  2.70000000e+01  1.00000000e+02  9.10000000e+02
  6.20000000e+01  3.11000000e+02  5.80000000e+01  1.70000000e+01
  2.10000000e+01  2.80000000e+01  7.10000000e+01  3.45000000e+02
  1.19000000e+02  3.50000000e+01  4.20000000e+01  6.50000000e+01
  5.00000000e+01  4.12000000e+02  7.90000000e+01  2.00000000e+01
  7.11000000e+02  5.30000000e+01  1.35000000e+02]
['-999999.999'
 'https://journeynorth.org/jnorth/images/userfiles2013/1193346010.jpg'
 'https://www.learner.org/jnorth/images/userfiles/1317067653.jpg' ...
 '//journeynorth.org/jnorth/images/userfiles2021/05/1526513089.jpg'
 '//journeynorth.org/jnorth/images/userfiles2021/05/1526513090.jpg'
 '//journeynorth.org/jnorth/images/userfiles2021/06/1526524404.jpg']
[     135      150  9701054 ... 10042506 10042509 10042557]
[-9.99999999e+05  0.00000000e+00  1.50000000e+02  2.00000000e+01
  8.90000000e+01  3.00000000e+01  2.00000000e+03  5.00000000e+01
  7.50000000e+03  2.30000000e+01  2.00000000e+02  5.00000000e+00
  3.00000000e+02  4.00000000e+00  1.00000000e+02  7.10000000e+01
  1.20000000e+02  3.25000000e+02  2.10000000e+01  2.80000000e+01
  5.00000000e+03  2.00000000e+04  3.60000000e+01  2.50000000e+01
  6.00000000e+00  5.40000000e+01  1.00000000e+03  1.60000000e+02
  2.40000000e+01  6.00000000e+01  3.70000000e+01  2.00000000e+00
  3.00000000e+03  1.00000000e+06  1.00000000e+01  1.00000000e+00
  2.00000000e+06  4.00000000e+01  8.50000000e+01  6.50000000e+01
  1.50000000e+01  8.00000000e+00  5.00000000e+02  1.40000000e+01
  1.12000000e+02  7.50000000e+01  8.00000000e+01  1.50000000e+04
  1.80000000e+01  1.00000000e+04  9.12000000e+02  1.00000000e+05
  4.00000000e+02  8.00000000e+02  1.20000000e+01  3.50000000e+01
  6.00000000e+02  1.60000000e+01  2.50000000e+04  1.50000000e+03
  1.11700000e+03  7.00000000e+01  3.00000000e+00  4.63000000e+02
  4.50000000e+01  7.20000000e+01  2.50000000e+02  1.82000000e+02
  5.60000000e+01  2.60000000e+01  3.00000000e+04  2.50000000e+03
  8.00000000e+03  7.50000000e+02  7.00000000e+02  4.60000000e+01
  5.56000000e+02  3.40000000e+01  2.75000000e+02  5.30000000e+01
  2.20000000e+01  6.50000000e+02  2.10000000e+02  2.24000000e+02
  1.10000000e+03  2.40000000e+02  2.00000000e+05  9.00000000e+02
  1.20000000e+03  7.00000000e+00  1.30000000e+01  1.15000000e+02
  1.10000000e+01  1.90000000e+01  8.10000000e+02  6.60000000e+01
  4.30000000e+01  5.10000000e+02  9.00000000e+00  6.20000000e+01
  2.70000000e+01  2.90000000e+02  1.04000000e+02  4.40000000e+01
  4.40000000e+02  2.02000000e+02  5.50000000e+01  1.80000000e+02
  1.70000000e+01  1.40000000e+02  2.69000000e+02  6.10000000e+01
  1.42000000e+02  1.75000000e+02  4.10000000e+01  1.23000000e+02
  3.20000000e+01  7.60000000e+01  3.10000000e+01  1.95000000e+02
  1.25000000e+02  2.90000000e+01  1.64000000e+02  1.09000000e+02
  1.19000000e+02  1.05000000e+02  4.00000000e+03  6.90000000e+01
  3.60000000e+02  8.80000000e+01  5.80000000e+01  2.39000000e+02
  4.80000000e+01  3.10000000e+02  1.17000000e+02  5.20000000e+01
  2.61000000e+02  9.00000000e+01  1.35000000e+02  2.96000000e+02
  2.11000000e+02  3.90000000e+01  5.10000000e+01  1.02000000e+02
  7.00100000e+03  1.27000000e+02  4.90000000e+01  4.70000000e+01
  3.30000000e+01  1.30000000e+03  4.20000000e+01  1.01000000e+02
  5.07500000e+03  1.52000000e+03  1.70000000e+02  8.10000000e+01
  1.90000000e+02  3.80000000e+01  1.10000000e+02  5.58000000e+02
  3.81000000e+02  2.28000000e+02  2.48000000e+02  8.60000000e+01
  7.40000000e+01  1.72000000e+02  2.30000000e+02  4.20000000e+02
  2.80600000e+03  9.40000000e+01  9.20000000e+01  1.18000000e+02
  4.25000000e+02  5.40000000e+03  6.30000000e+03  6.80000000e+01
  7.90000000e+01  5.00000000e+04  2.30000000e+03  7.00000000e+03
  8.40000000e+01  1.28000000e+02  5.70000000e+01  3.50000000e+02
  8.30000000e+01  1.24000000e+02  1.14000000e+02  4.50000000e+02
  1.47000000e+02  5.01000000e+02  8.70000000e+01  7.70000000e+01
  1.97000000e+02  8.40000000e+02  1.34600000e+04  3.50000000e+03
  6.40000000e+01  7.30000000e+01  1.78000000e+02  2.65000000e+02
  1.51000000e+02  1.33000000e+02  1.21000000e+02  4.77000000e+02
  5.90000000e+01  9.70000000e+01  8.50000000e+02  1.30000000e+02
  1.65000000e+02  9.50000000e+01  3.83000000e+02  9.80000000e+01
  7.29000000e+02  2.22000000e+02  1.16000000e+02  2.25000000e+02
  6.30000000e+01  6.00000000e+03  4.75000000e+02  3.40000000e+04
  1.34200000e+04  2.13290000e+04  1.20730000e+04  1.62440000e+04
  3.02930000e+04  1.10820000e+04  7.80000000e+01  2.14000000e+02
  1.13000000e+02  1.08000000e+02  2.80000000e+02  2.12000000e+02
  1.38000000e+02  2.85000000e+02  2.29000000e+02  2.16000000e+02
  7.20000000e+02  2.06000000e+02  6.06000000e+02  2.87000000e+02
  1.07000000e+02  1.34000000e+02  1.57000000e+02  5.40000000e+02
  1.00000000e+07  2.20000000e+02  1.03000000e+02  2.70000000e+02
  8.20000000e+01  1.39000000e+02  3.18000000e+02  9.30000000e+01
  6.70000000e+01  1.81000000e+02  1.22000000e+02  1.58000000e+02
  1.56000000e+02  2.32000000e+02  1.06000000e+02  1.55000000e+02
  2.40000000e+03  6.67000000e+02  1.28600000e+03  1.79000000e+02
  3.49000000e+02  2.07000000e+02  5.05000000e+02  1.32000000e+02
  1.54000000e+02  1.40000000e+03  3.29140000e+04  2.98040000e+04
  1.81280000e+04  1.58900000e+04  7.75000000e+03  8.53100000e+03
  7.33300000e+03  7.78300000e+03  1.73000000e+02  2.13000000e+02
  1.26000000e+02  3.78000000e+02  4.17000000e+02  4.81000000e+02
  7.80000000e+02  4.80000000e+03  6.25000000e+02  2.08000000e+02
  2.05000000e+02  1.45000000e+02  2.60000000e+02  1.93000000e+02
  1.44000000e+02  2.27000000e+02  3.05000000e+02  8.31000000e+02
  2.89000000e+02  2.46000000e+02  4.04000000e+02  1.52000000e+02
  9.60000000e+01  3.73000000e+02  8.55000000e+02  1.80000000e+03
  5.19000000e+02  2.15000000e+02  4.41000000e+02  3.37000000e+02
  2.38000000e+04  2.18000000e+02  3.40000000e+02  2.31000000e+02
  2.10000000e+03  5.50000000e+02  4.50000000e+03  3.20000000e+02
  9.00000000e+03  1.20000000e+04  3.24000000e+02  4.61000000e+02
  1.84000000e+02  5.70000000e+02  4.44000000e+02  6.20000000e+02
  1.10000000e+04  8.70000000e+02  4.78000000e+02  2.52000000e+02
  4.47000000e+02  2.47000000e+02  2.81000000e+02  9.80000000e+02
  2.80730000e+04  1.34920000e+04  1.28640000e+04  1.14720000e+04
  1.02000000e+04  3.01000000e+02  1.11000000e+02  2.59000000e+02
  1.71000000e+02  1.41000000e+02  2.56000000e+02  1.86000000e+02
  1.74000000e+02  1.98000000e+02  4.79000000e+02  1.87000000e+02
  2.23000000e+02  4.74000000e+02  2.03000000e+02  2.78000000e+02
  1.53000000e+02  2.57000000e+02  5.20000000e+02  1.85000000e+02
  3.20000000e+03  3.75000000e+02  2.58000000e+02  1.36000000e+02
  7.00000000e+04  6.02000000e+04  4.80000000e+04  1.78000000e+04
  2.64000000e+02  1.97550000e+04  1.71000000e+04  1.21890000e+04
  1.33750000e+04  2.33000000e+02  2.04000000e+02  1.92000000e+02
  1.31000000e+02 -1.00000000e+00  1.29000000e+02  1.49000000e+02
 -1.70000000e+01  4.60000000e+02  3.82000000e+02  1.37000000e+02
  1.43000000e+02  4.45000000e+02  9.10000000e+01  1.70000000e+03
  3.30000000e+02  2.54000000e+02  4.29000000e+02  8.13000000e+02
  2.20000000e+03  3.16000000e+02  2.60000000e+03  6.96000000e+02
  2.91000000e+02  2.55000000e+02  2.86000000e+02  5.43000000e+02
  1.83000000e+02  2.51000000e+02  3.62000000e+02  2.26000000e+02
  4.53000000e+02  1.08000000e+03  8.60000000e+02  3.15000000e+02
  3.32000000e+02  2.44000000e+02  1.35100000e+03  3.50000000e+04
  1.50300000e+03  1.12500000e+03  7.25000000e+02  1.48200000e+03
  5.93000000e+02  2.07900000e+03  1.22840000e+04  1.97410000e+04
  1.23600000e+04  1.00990000e+04  5.87000000e+02  1.90000000e+04
  5.00000000e+05  1.89000000e+02  6.71000000e+02  7.13000000e+02
  1.01600000e+03  1.76000000e+02  3.45000000e+02  2.19000000e+02
  2.34000000e+02  2.49000000e+02  4.09000000e+02  4.18000000e+02
  1.60000000e+04  3.90000000e+03  1.69000000e+02  7.20000000e+03
  2.72000000e+02  2.84000000e+02  6.53000000e+02  4.28000000e+02
  3.48000000e+02  7.77000000e+02  2.53000000e+02  9.90000000e+01
  2.01000000e+02  1.51600000e+03  3.35000000e+02  3.59000000e+02
  3.56000000e+02  8.75000000e+02  5.60000000e+02  1.77000000e+02
  5.25000000e+02  6.86000000e+02  1.38000000e+03  2.76000000e+02
  9.99999000e+05  1.26200000e+04  6.50000000e+03  5.85000000e+03
  1.88000000e+02  2.96000000e+03  4.80000000e+02  3.85000000e+02
  8.27000000e+02  3.23000000e+02  1.48000000e+02  1.01200000e+03
  4.65000000e+02  1.96000000e+02  1.62000000e+02  2.38000000e+02
  4.46000000e+02  3.13000000e+02  2.38500000e+03  3.07000000e+02
  2.63000000e+02  3.57000000e+02  1.63000000e+02  4.95000000e+02
  1.00100000e+03  5.41000000e+02  7.33000000e+02  1.67000000e+02
  3.60000000e+03  4.57000000e+02  5.70000000e+03  1.65000000e+03
  1.12000000e+03  3.55300000e+03  9.95000000e+02  1.60000000e+03
  1.39000000e+03  6.14000000e+02  7.60000000e+03  8.25000000e+03
  3.14000000e+02  1.58000000e+03  2.21000000e+02  1.62000000e+03
  4.70000000e+02  7.59000000e+02  2.67000000e+02  9.60000000e+02
  1.30100000e+03  5.66000000e+02  3.42000000e+02  8.80000000e+02
  7.82000000e+02  2.41000000e+02  5.14000000e+02  2.25000000e+03
  2.47000000e+03  9.25000000e+02  4.03000000e+02  1.66000000e+02
  6.76900000e+03  1.46000000e+02  2.46900000e+03  2.09000000e+02
  2.79000000e+02  8.68000000e+02  5.85000000e+02  3.11000000e+02
  6.83000000e+02  3.54000000e+02  3.08000000e+02  7.60000000e+02
  3.87000000e+02  5.63000000e+02  8.01000000e+02  5.36000000e+02
  1.61000000e+02  3.97000000e+02  3.22000000e+02  6.13000000e+02
  1.91000000e+02  1.75000000e+03  1.99000000e+02  5.16000000e+02
  3.21000000e+02  1.85000000e+03  2.77000000e+02  2.97000000e+02
  4.75000000e+03  3.70000000e+02  4.89000000e+02  1.14900000e+03
  2.68000000e+02  2.81600000e+03  7.89000000e+02  4.30000000e+02
  9.78000000e+02  7.70000000e+02  4.93000000e+02  7.16000000e+02
  1.59000000e+02]
[1 2 0]
['Monarch Butterfly' 'Monarch Migration' 'FIRST Monarch Butterfly'
 'FIRST Monarch Egg' 'First Monarch' 'FIRST Monarch' 'LAST Fall Monarch'
 'Monarch (OTHER observations)' 'Monarch (FIRST sighting)'
 'Monarch (FIRST seen)' 'Monarch (Other Sightings)'
 'Monarch (OTHER observation)' 'Monarch (OTHER Observation)'
 'Monarch Migration Sighting' 'Monarch (OTHER Observations)'
 'Monarch Migration Study' 'LAST Fall Monarch Sighted'
 ' LAST Fall Monarch Sighted' 'LAST Fall Monarch Migration'
 'Monarch (OTHER oservations)' 'Monarch (LAST sighting)'
 'Monarch Larva (FIRST sighted)' 'Monarch Egg (FIRST sighted)'
 'Monarch Adult (FIRST sighted)' 'Monarch Adult (FIRST Sighted)'
 'Monarch PEAK Migration' 'LAST Fall Monarch Sighting'
 'Monarchs OTHER (Observation)' '(Monarch) Milkweed emerges'
 'Monarch FIRST Migration Sighting' 'Monarch peak Migration'
 'Monarch (OTHER) Observations' 'Milkweed (FIRST Leaves)'
 'Monarch Over-wintering' 'Monarch Adult  (FIRST sighted)'
 'Monarchs (OTHER observations)' 'Monarch (IOTHER observations)'
 'Monarch Fall Roost' 'Monarch ADULT' 'Monarch Larva (FIRST Sighted)'
 'Monarch (OTHER Observations' 'Monarch Peak Migration'
 'Monarch over-wintering' 'Monarch  Adult (FIRST sighted)'
 'Monarch (Other Observations)' 'Monarch FIRST Adult'
 'Monarch Adult (First sighted)' 'Monarch (Other observations)'
 'Monarch Migration Sighting OW' 'Monarch (FIRST sighted)'
 'Monarch (NONE sighted)' 'Monarch Fall Roost (None yet)'
 'Monarch Adult Sighted' 'Monarch Sighting' 'Monarch (Other Observations'
 'Monarch Winter Sighting' 'Monarch Sighted' 'Monarch Egg Sighted'
 'Monarch Larva Sighted' 'Monarch OTHER Observations'
 'monarch (OTHER Observations)' 'Monarch Egg (FIRST Sighted)'
 'Monarch OW Mexico' 'Monarch Adult  Sighted'
 'Monarch (OTHER Observations) READY' 'Monarch Adult (FIRST sighted))'
 'Monarch, Captive-Reared' 'Monarch Fall Roost (waiting for permission)'
 'Milkweed Sighted' 'Milkweed (FIRST sighted)' 'Milkweed (FIRST Sighted)'
 'Milkweed sighted' 'Monarch, Captive Reared'
 'Monarch Egg (FIRST sighted)ghted)'
 'Monarch Adult (FIRST sighted)T sighted)'
 'Monarch Adult (FIRST sighted)sighted)' 'Monarch (Captive Reared)ed)'
 'Monarch (Captive Reared)' 'Monarch (OTHER Observations)ations)'
 'Monarch Larva Sighted ' 'Monarch Fall Roost ' 'Monarch Egg Sighted '
 'Monarch, captive-Reared' 'MOnarch Larva Sighted'
 'Monarch Adult Sighted ' 'Monarch adult Sighted' 'Monarch Adult SIghted'
 'Monarch Adult (FIRST sighted) ' 'Monarchch Adult Sighted'

In [10]:
# Determine the number of unique values in each column.
for col in JNorth1996_2020_df:
  print(JNorth1996_2020_df[col].value_counts())

850841703     1
1526350827    1
1526350816    1
1526350817    1
1526350818    1
             ..
1432512422    1
1432519704    1
1432562236    1
1432562641    1
1526525021    1
Name: id, Length: 227433, dtype: int64
2018-08-22    392
2018-10-03    377
2018-09-06    353
2019-09-19    337
2018-09-12    335
             ...
2015-12-31      1
2015-11-24      1
2015-11-22      1
2006-07-30      1
1996-12-16      1
Name: sighting_date, Length: 7491, dtype: int64
Monarch Adult Sighted            102306
Monarch Adult (FIRST sighted)     36409
Monarch Larva Sighted             17378
Monarch, Captive-Reared           14339
Monarch (OTHER Observations)      13581
Monarch Egg Sighted                8736
Milkweed (FIRST sighted)           8465
Monarch PEAK Migration             7689
Monarch Egg (FIRST sighted)        6876
Monarch Fall Roost                 5035
Monarch Larva (FIRST sighted)      4898
Milkweed Sighted                   1721
Name: species, dtype: int64
1       139319
2        24169
3        13055
4         7795
5         6118
         ...
860          1
315          1
244          1
1351         1
159          1
Name: number, Length: 555, dtype: int64
29.757    811
30.230    765
45.033    702
37.944    700
42.409    659
         ...
30.770      1
38.355      1
33.305      1
29.930      1
27.594      1
Name: latitude, Length: 18851, dtype: int64
-95.365     807
-97.714     752
-87.405     695
-93.224     620
-82.220     605
           ...
-77.529       1
-69.400       1
-101.051      1
-69.254       1
-122.557      1
Name: longitude, Length: 30123, dtype: int64
1    136009
0     91424
Name: flag_location, dtype: int64
-999999.999                                                                                                                                                               1427
Female                                                                                                                                                                     170
Flying                                                                                                                                                                     144
Male                                                                                                                                                                       118
Recorded as an incidental sighting while conducting surveys on the Fort Hood military base.                                                                                104
                                                                                                                                                                          ...
first female sighting around 3 pm in richmond-laid egg on common milkweed.  Warm sw wind -monarch looked fresh                                                               1
Spotted our first milkweed shoots in our butterfly garden at Lake Anne Elementary this afternoon after the first weekend with warmer temperatures.                           1
Spotted 1 adult near Love Valley Wildlife Reserve near the Red River.                                                                                                        1
Established Asclepias syriaca L. plants in open area have emerged approximately 1 inch in height one day after 0.7" rainfall.                                                1
Date of last adult sighted.Total sightings were 98 adults from June 3 to Sept. 4.Peak sightings were July 8 to Aug 7.Approx. acreage with milkweed is equal to 4.5Ac.        1
Name: comments, Length: 212736, dtype: int64
-999999.999                            139036
-999999.999                             63593
None                                      457
Homeschool                                331
Virginia living museum                    263
                                        ...
William e. norris elementary school         1
Coventry elementary school                  1
Adams is close                              1
Salem elementary school                     1
Walker memorial junior academy              1
Name: school, Length: 6914, dtype: int64
-999999.999    206370
 99.000          3136
 4.000           2947
 3.000           2543
 2.000           2541
                ...
 1012.000           1
 678.000            1
 69.000             1
 95.000             1
 135.000            1
Name: grade, Length: 67, dtype: int64
-999999.999                                                                   183911
//sightings.journeynorth.org/jnorth/images/userfiles2018/09/1526362818.jpg         8
https://journeynorth.org/jnorth/images/userfiles/1366245309.jpg                    3
https://journeynorth.org/jnorth/images/userfiles/1331931236.jpg                    3
//journeynorth.org/jnorth/images/userfiles2020/04/1526445894.jpg                   2
                                                                               ...
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327046.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327055.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327056.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327063.jpg             1
//journeynorth.org/jnorth/images/userfiles2021/06/1526524404.jpg                   1
Name: image_url, Length: 43474, dtype: int64
9710973     7256
9979617     2054
9976074     1055
9975275      900
10010858     757
            ...
9979243        1
9979242        1
9979240        1
9979216        1
10042557       1
Name: customerid, Length: 42518, dtype: int64
 1.000         73436
-999999.999    64715
 2.000         24169
 3.000         13055
 4.000          7795
               ...
 445.000           1
 1700.000          1
 254.000           1
 429.000           1
 159.000           1
Name: number_old, Length: 557, dtype: int64
0    161550
1     64715
2      1168
Name: flag_number, dtype: int64
Monarch Adult Sighted                          91662
Monarch Adult (FIRST sighted)                  25311
Monarch Larva Sighted                          17373
Monarch, Captive-Reared                        14329
Monarch (OTHER Observations)                   10626
                                               ...
monarch (OTHER Observations)                       1
Monarch (OTHER Observations) READY                 1
Monarch Fall Roost (waiting for permission)        1
Monarch, Captive Reared                            1
Monarch, Captive-reared                            1
Name: species_old, Length: 96, dtype: int64
0    197793
1     29640
Name: flag_species, dtype: int64

In [11]:
# Find null values
for column in JNorth1996_2020_df.columns:
   print(f"Column {column} has {JNorth1996_2020_df[column].isnull().sum()} null values")

Column id has 0 null values
Column sighting_date has 0 null values
Column species has 0 null values
Column number has 0 null values
Column latitude has 0 null values
Column longitude has 0 null values
Column flag_location has 0 null values
Column comments has 0 null values
Column school has 0 null values
Column grade has 0 null values
Column image_url has 0 null values
Column customerid has 0 null values
Column number_old has 0 null values
Column flag_number has 0 null values
Column species_old has 0 null values
Column flag_species has 0 null values

In [12]:
# Find duplicate entries
print(f"Duplicate entries: {JNorth1996_2020_df.duplicated().sum()}")

Duplicate entries: 0

In [13]:
# filtering by type of observation (Monarch Adult Sighted)
JNorth_Adult_First_Site_df = JNorth1996_2020_df[JNorth1996_2020_df['species']=='Monarch Adult (FIRST sighted)']
JNorth_Adult_First_Site_df.head()

,id,sighting_date,species,number,latitude,longitude,flag_location,comments,school,grade,image_url,customerid,number_old,flag_number,species_old,flag_species
688,886471649,1998-02-01,Monarch Adult (FIRST sighted),1,29.957,-90.078,0,We saw 2 butterflies hatch this weekend. We b...,-999999.999,-999999.999,-999999.999,9704694,-999999.999,1,FIRST Monarch Butterfly,1
689,887033189,1998-02-08,Monarch Adult (FIRST sighted),1,30.894,-102.086,0,-999999.999,Iraan elementary,5.000,-999999.999,719,-999999.999,1,FIRST Monarch Butterfly,1
691,887158601,1998-01-17,Monarch Adult (FIRST sighted),1,28.529,-96.679,0,Netted and tagged Monarch female laying eggs o...,Victoria christian school,7.000,-999999.999,9704928,-999999.999,1,FIRST Monarch Butterfly,1
692,887283990,1998-02-12,Monarch Adult (FIRST sighted),1,28.529,-96.679,0,Have had a few Monarchs overwintering in this ...,Victoria christian school,7.000,-999999.999,9704928,-999999.999,1,FIRST Monarch Butterfly,1
694,887294257,1997-12-20,Monarch Adult (FIRST sighted),1,29.757,-95.365,0,Monarchs have been sighted in backyards with ...,Kinkaid school,8.000,-999999.999,728,-999999.999,1,FIRST Monarch Butterfly,1

In [14]:
JNorth_Adult_First_Site_df.to_csv('JNorth_Adult_First_Site.csv', header=True, mode='w' )

In [15]:
JNorth_Adult_First_Site_df.shape

(36409, 16)

# Format file for geoJSON

In [16]:
JNorth_Adult_First_Site_df = pd.DataFrame(JNorth_Adult_First_Site_df)
JNorth_Adult_First_Site_df.drop(['id','flag_location', 'comments','school','grade','image_url','customerid','number_old','flag_number','species_old','flag_species'], axis=1, inplace=True)
JNorth_Adult_First_Site_df.head()

    sighting_date                        species  number  latitude  longitude
688    1998-02-01  Monarch Adult (FIRST sighted)       1    29.957    -90.078
689    1998-02-08  Monarch Adult (FIRST sighted)       1    30.894   -102.086
691    1998-01-17  Monarch Adult (FIRST sighted)       1    28.529    -96.679
692    1998-02-12  Monarch Adult (FIRST sighted)       1    28.529    -96.679
694    1997-12-20  Monarch Adult (FIRST sighted)       1    29.757    -95.365

In [17]:
cols = ['sighting_date', 'species', 'number', 'latitude', 'longitude']

In [18]:
JNorth_Adult_First_Site_df =JNorth_Adult_First_Site_df.groupby(['sighting_date', 'species', 'latitude', 'longitude']).sum().reset_index()
JNorth_Adult_First_Site_df.head()

  sighting_date                        species  latitude  longitude  number
0    1997-03-01  Monarch Adult (FIRST sighted)    26.220    -98.490       1
1    1997-03-01  Monarch Adult (FIRST sighted)    29.650    -94.850       1
2    1997-03-11  Monarch Adult (FIRST sighted)    29.420    -95.350       1
3    1997-03-16  Monarch Adult (FIRST sighted)    29.635    -95.635       1
4    1997-03-19  Monarch Adult (FIRST sighted)    29.635    -95.635       1

In [19]:
JNorth_Adult_First_Site_df.columns.tolist()

['sighting_date', 'species', 'latitude', 'longitude', 'number']

In [20]:
JNorth_Adult_First_Site_df.head()

  sighting_date                        species  latitude  longitude  number
0    1997-03-01  Monarch Adult (FIRST sighted)    26.220    -98.490       1
1    1997-03-01  Monarch Adult (FIRST sighted)    29.650    -94.850       1
2    1997-03-11  Monarch Adult (FIRST sighted)    29.420    -95.350       1
3    1997-03-16  Monarch Adult (FIRST sighted)    29.635    -95.635       1
4    1997-03-19  Monarch Adult (FIRST sighted)    29.635    -95.635       1

In [21]:
JNorth_Adult_First_Site_df.shape

(35489, 5)

In [22]:
JNorth_Adult_First_Site_year_df = JNorth_Adult_First_Site_df
JNorth_Adult_First_Site_year_df['year'] = pd.DatetimeIndex(JNorth_Adult_First_Site_df['sighting_date']).year

# 2001

In [23]:
JNorth_Adult_First_Site_2001_df = JNorth_Adult_First_Site_year_df[JNorth_Adult_First_Site_year_df['year']==2001]
JNorth_Adult_First_Site_2001_df.tail()

,sighting_date,species,latitude,longitude,number,year
3427,2001-11-16,Monarch Adult (FIRST sighted),30.449,-91.188,1,2001
3428,2001-11-25,Monarch Adult (FIRST sighted),28.529,-96.679,1,2001
3429,2001-11-28,Monarch Adult (FIRST sighted),35.742,-91.520,1,2001
3430,2001-12-03,Monarch Adult (FIRST sighted),35.742,-91.520,1,2001
3431,2001-12-20,Monarch Adult (FIRST sighted),28.529,-96.679,1,2001

In [24]:
JNorth_Adult_First_Site_2001_df.shape

(1319, 6)

In [25]:
JNorth_Adult_First_Site_2001_df = pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_df.drop(['year'], axis=1, inplace=True)

In [26]:
JNorth_Adult_First_Site_2001_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2001_df['sighting_date']).month

## January

In [27]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_1_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==1]
JNorth_Adult_First_Site_2001_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
2114,2001-01-01,Monarch Adult (FIRST sighted),29.042,-95.467,1,1
2115,2001-01-01,Monarch Adult (FIRST sighted),29.385,-95.788,1,1
2116,2001-01-06,Monarch Adult (FIRST sighted),26.208,-97.684,1,1
2117,2001-01-13,Monarch Adult (FIRST sighted),29.047,-82.046,1,1
2118,2001-01-22,Monarch Adult (FIRST sighted),29.957,-90.078,1,1

In [28]:
JNorth_Adult_First_Site_2001_1_df.shape

(6, 6)

In [29]:
JNorth_Adult_First_Site_2001_1_df = pd.DataFrame(JNorth_Adult_First_Site_2001_1_df)
JNorth_Adult_First_Site_2001_1_df.drop(['month'], axis=1, inplace=True)

In [30]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_1_df['latitude'] = JNorth_Adult_First_Site_2001_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_1_df['longitude'] = JNorth_Adult_First_Site_2001_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [31]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_1_df, cols)

In [32]:
file = open("JNorth_Adult_First_Site_2001_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [33]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_2_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==2]
JNorth_Adult_First_Site_2001_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
2137,2001-02-20,Monarch Adult (FIRST sighted),27.954,-82.457,1,2
2138,2001-02-23,Monarch Adult (FIRST sighted),28.529,-96.679,1,2
2139,2001-02-25,Monarch Adult (FIRST sighted),29.757,-95.365,1,2
2140,2001-02-26,Monarch Adult (FIRST sighted),27.980,-82.781,1,2
2141,2001-02-26,Monarch Adult (FIRST sighted),30.582,-87.155,1,2

In [34]:
JNorth_Adult_First_Site_2001_2_df.shape

(23, 6)

In [35]:
JNorth_Adult_First_Site_2001_2_df= pd.DataFrame(JNorth_Adult_First_Site_2001_2_df)
JNorth_Adult_First_Site_2001_2_df.drop(['month'], axis=1, inplace=True)

In [36]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_2_df['latitude'] = JNorth_Adult_First_Site_2001_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_2_df['longitude'] = JNorth_Adult_First_Site_2001_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [37]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_2_df, cols)

In [38]:
file = open("JNorth_Adult_First_Site_2001_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [39]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_3_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==3]
JNorth_Adult_First_Site_2001_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
2218,2001-03-30,Monarch Adult (FIRST sighted),29.757,-95.365,1,3
2219,2001-03-31,Monarch Adult (FIRST sighted),29.757,-95.365,1,3
2220,2001-03-31,Monarch Adult (FIRST sighted),30.613,-96.320,1,3
2221,2001-03-31,Monarch Adult (FIRST sighted),32.328,-96.799,1,3
2222,2001-03-31,Monarch Adult (FIRST sighted),32.794,-98.110,1,3

In [40]:
JNorth_Adult_First_Site_2001_3_df.shape

(81, 6)

In [41]:
JNorth_Adult_First_Site_2001_3_df =pd.DataFrame(JNorth_Adult_First_Site_2001_3_df)
JNorth_Adult_First_Site_2001_3_df.drop(['month'], axis=1, inplace=True)

In [42]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_3_df['latitude'] = JNorth_Adult_First_Site_2001_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_3_df['longitude'] = JNorth_Adult_First_Site_2001_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [43]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_3_df, cols)

In [44]:
file = open("JNorth_Adult_First_Site_2001_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [45]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_4_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==4]
JNorth_Adult_First_Site_2001_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
2319,2001-04-29,Monarch Adult (FIRST sighted),40.750,-73.998,1,4
2320,2001-04-29,Monarch Adult (FIRST sighted),42.790,-71.221,1,4
2321,2001-04-30,Monarch Adult (FIRST sighted),34.886,-101.903,1,4
2322,2001-04-30,Monarch Adult (FIRST sighted),38.250,-82.250,1,4
2323,2001-04-30,Monarch Adult (FIRST sighted),42.345,-96.267,1,4

In [46]:
JNorth_Adult_First_Site_2001_4_df.shape

(101, 6)

In [47]:
JNorth_Adult_First_Site_2001_4_df = pd.DataFrame(JNorth_Adult_First_Site_2001_4_df)
JNorth_Adult_First_Site_2001_4_df.drop(['month'], axis=1, inplace=True)

In [48]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_4_df['latitude'] = JNorth_Adult_First_Site_2001_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_4_df['longitude'] = JNorth_Adult_First_Site_2001_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [49]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_4_df, cols)

In [50]:
file = open("JNorth_Adult_First_Site_2001_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [51]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_5_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==5]
JNorth_Adult_First_Site_2001_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
2584,2001-05-31,Monarch Adult (FIRST sighted),39.822,-81.931,1,5
2585,2001-05-31,Monarch Adult (FIRST sighted),41.654,-72.669,1,5
2586,2001-05-31,Monarch Adult (FIRST sighted),43.167,-79.367,1,5
2587,2001-05-31,Monarch Adult (FIRST sighted),44.359,-98.224,1,5
2588,2001-05-31,Monarch Adult (FIRST sighted),44.900,-79.717,1,5

In [52]:
JNorth_Adult_First_Site_2001_5_df.shape

(265, 6)

In [53]:
JNorth_Adult_First_Site_2001_5_df =pd.DataFrame(JNorth_Adult_First_Site_2001_5_df)
JNorth_Adult_First_Site_2001_5_df.drop(['month'], axis=1, inplace=True)

In [54]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_5_df['latitude'] = JNorth_Adult_First_Site_2001_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_5_df['longitude'] = JNorth_Adult_First_Site_2001_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [55]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_5_df, cols)

In [56]:
file = open("JNorth_Adult_First_Site_2001_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [57]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_6_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==6]
JNorth_Adult_First_Site_2001_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
2646,2001-06-20,Monarch Adult (FIRST sighted),42.510,-70.908,1,6
2647,2001-06-22,Monarch Adult (FIRST sighted),49.490,-94.260,1,6
2648,2001-06-23,Monarch Adult (FIRST sighted),45.580,-74.370,1,6
2649,2001-06-27,Monarch Adult (FIRST sighted),40.475,-79.954,1,6
2650,2001-06-29,Monarch Adult (FIRST sighted),42.540,-78.560,1,6

In [58]:
JNorth_Adult_First_Site_2001_6_df.shape

(62, 6)

In [59]:
JNorth_Adult_First_Site_2001_6_df=pd.DataFrame(JNorth_Adult_First_Site_2001_6_df)
JNorth_Adult_First_Site_2001_6_df.drop(['month'], axis=1, inplace=True)

In [60]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_6_df['latitude'] = JNorth_Adult_First_Site_2001_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_6_df['longitude'] = JNorth_Adult_First_Site_2001_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [61]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_6_df, cols)

In [62]:
file = open("JNorth_Adult_First_Site_2001_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [63]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_7_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==7]
JNorth_Adult_First_Site_2001_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
2658,2001-07-21,Monarch Adult (FIRST sighted),41.391,-73.970,1,7
2659,2001-07-22,Monarch Adult (FIRST sighted),35.364,-94.416,1,7
2660,2001-07-24,Monarch Adult (FIRST sighted),38.939,-85.877,1,7
2661,2001-07-28,Monarch Adult (FIRST sighted),46.996,-95.003,1,7
2662,2001-07-30,Monarch Adult (FIRST sighted),34.137,-118.027,1,7

In [64]:
JNorth_Adult_First_Site_2001_7_df.shape

(12, 6)

In [65]:
JNorth_Adult_First_Site_2001_7_df = pd.DataFrame(JNorth_Adult_First_Site_2001_7_df)
JNorth_Adult_First_Site_2001_7_df.drop(['month'], axis=1, inplace=True)

In [66]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_7_df['latitude'] = JNorth_Adult_First_Site_2001_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_7_df['longitude'] = JNorth_Adult_First_Site_2001_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [67]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_7_df, cols)

In [68]:
file = open("JNorth_Adult_First_Site_2001_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [69]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_8_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==8]
JNorth_Adult_First_Site_2001_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
2916,2001-08-31,Monarch Adult (FIRST sighted),31.850,-102.345,1,8
2917,2001-08-31,Monarch Adult (FIRST sighted),37.776,-97.950,2,8
2918,2001-08-31,Monarch Adult (FIRST sighted),41.555,-93.253,1,8
2919,2001-08-31,Monarch Adult (FIRST sighted),42.804,-92.268,1,8
2920,2001-08-31,Monarch Adult (FIRST sighted),45.181,-93.578,1,8

In [70]:
JNorth_Adult_First_Site_2001_8_df.shape

(258, 6)

In [71]:
JNorth_Adult_First_Site_2001_8_df = pd.DataFrame(JNorth_Adult_First_Site_2001_8_df)
JNorth_Adult_First_Site_2001_8_df.drop(['month'], axis=1, inplace=True)

In [72]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_8_df['latitude'] = JNorth_Adult_First_Site_2001_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_8_df['longitude'] = JNorth_Adult_First_Site_2001_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [73]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_8_df, cols)

In [74]:
file = open("JNorth_Adult_First_Site_2001_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [75]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_9_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==9]
JNorth_Adult_First_Site_2001_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
3279,2001-09-30,Monarch Adult (FIRST sighted),35.980,-95.808,1,9
3280,2001-09-30,Monarch Adult (FIRST sighted),36.001,-83.404,1,9
3281,2001-09-30,Monarch Adult (FIRST sighted),42.278,-72.978,1,9
3282,2001-09-30,Monarch Adult (FIRST sighted),43.043,-76.151,1,9
3283,2001-09-30,Monarch Adult (FIRST sighted),43.220,-77.444,1,9

In [76]:
JNorth_Adult_First_Site_2001_9_df.shape

(363, 6)

In [77]:
JNorth_Adult_First_Site_2001_9_df = pd.DataFrame(JNorth_Adult_First_Site_2001_9_df)
JNorth_Adult_First_Site_2001_9_df.drop(['month'], axis=1, inplace=True)

In [78]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_9_df['latitude'] = JNorth_Adult_First_Site_2001_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_9_df['longitude'] = JNorth_Adult_First_Site_2001_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [79]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_9_df, cols)

In [80]:
file = open("JNorth_Adult_First_Site_2001_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [81]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_10_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==10]
JNorth_Adult_First_Site_2001_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
3415,2001-10-25,Monarch Adult (FIRST sighted),41.756,-72.764,1,10
3416,2001-10-29,Monarch Adult (FIRST sighted),29.200,-96.230,1,10
3417,2001-10-29,Monarch Adult (FIRST sighted),35.194,-80.827,1,10
3418,2001-10-29,Monarch Adult (FIRST sighted),46.947,-91.924,1,10
3419,2001-10-31,Monarch Adult (FIRST sighted),43.150,-79.040,1,10

In [82]:
JNorth_Adult_First_Site_2001_10_df.shape

(136, 6)

In [83]:
JNorth_Adult_First_Site_2001_10_df = pd.DataFrame(JNorth_Adult_First_Site_2001_10_df)
JNorth_Adult_First_Site_2001_10_df.drop(['month'], axis=1, inplace=True)

In [84]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_10_df['latitude'] = JNorth_Adult_First_Site_2001_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_10_df['longitude'] = JNorth_Adult_First_Site_2001_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [85]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_10_df, cols)

In [86]:
file = open("JNorth_Adult_First_Site_2001_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [87]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_11_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==11]
JNorth_Adult_First_Site_2001_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
3425,2001-11-10,Monarch Adult (FIRST sighted),28.529,-96.679,1,11
3426,2001-11-15,Monarch Adult (FIRST sighted),39.645,-105.381,2,11
3427,2001-11-16,Monarch Adult (FIRST sighted),30.449,-91.188,1,11
3428,2001-11-25,Monarch Adult (FIRST sighted),28.529,-96.679,1,11
3429,2001-11-28,Monarch Adult (FIRST sighted),35.742,-91.520,1,11

In [88]:
JNorth_Adult_First_Site_2001_11_df.shape

(10, 6)

In [89]:
JNorth_Adult_First_Site_2001_11_df = pd.DataFrame(JNorth_Adult_First_Site_2001_11_df)
JNorth_Adult_First_Site_2001_11_df.drop(['month'], axis=1, inplace=True)

In [90]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_11_df['latitude'] = JNorth_Adult_First_Site_2001_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_11_df['longitude'] = JNorth_Adult_First_Site_2001_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [91]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_11_df, cols)

In [92]:
file = open("JNorth_Adult_First_Site_2001_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [93]:
JNorth_Adult_First_Site_2001_month_df =pd.DataFrame(JNorth_Adult_First_Site_2001_df)
JNorth_Adult_First_Site_2001_12_df = JNorth_Adult_First_Site_2001_month_df[JNorth_Adult_First_Site_2001_month_df['month']==12]
JNorth_Adult_First_Site_2001_12_df.tail()

,sighting_date,species,latitude,longitude,number,month
3430,2001-12-03,Monarch Adult (FIRST sighted),35.742,-91.520,1,12
3431,2001-12-20,Monarch Adult (FIRST sighted),28.529,-96.679,1,12

In [94]:
JNorth_Adult_First_Site_2001_12_df.shape

(2, 6)

In [95]:
JNorth_Adult_First_Site_2001_12_df = pd.DataFrame(JNorth_Adult_First_Site_2001_12_df)
JNorth_Adult_First_Site_2001_12_df.drop(['month'], axis=1, inplace=True)

In [96]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2001_12_df['latitude'] = JNorth_Adult_First_Site_2001_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2001_12_df['longitude'] = JNorth_Adult_First_Site_2001_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [97]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2001_12_df, cols)

In [98]:
file = open("JNorth_Adult_First_Site_2001_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2002

In [99]:
JNorth_Adult_First_Site_2002_df = JNorth_Adult_First_Site_year_df[JNorth_Adult_First_Site_year_df['year']==2002]
JNorth_Adult_First_Site_2002_df.tail()

,sighting_date,species,latitude,longitude,number,year
4775,2002-11-10,Monarch Adult (FIRST sighted),43.420,-79.250,2,2002
4776,2002-11-11,Monarch Adult (FIRST sighted),25.884,-80.182,1,2002
4777,2002-11-11,Monarch Adult (FIRST sighted),29.757,-95.365,1,2002
4778,2002-11-14,Monarch Adult (FIRST sighted),34.580,-83.584,1,2002
4779,2002-11-28,Monarch Adult (FIRST sighted),37.904,-122.536,1,2002

In [100]:
JNorth_Adult_First_Site_2002_df.shape

(1348, 6)

In [101]:
JNorth_Adult_First_Site_2002_df = pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_df.drop(['year'], axis=1, inplace=True)

In [102]:
JNorth_Adult_First_Site_2002_df.tail

<bound method NDFrame.tail of      sighting_date                        species  latitude  longitude  number
3432    2002-02-23  Monarch Adult (FIRST sighted)    29.827    -95.988       1
3433    2002-02-26  Monarch Adult (FIRST sighted)    33.978   -118.447       1
3434    2002-02-27  Monarch Adult (FIRST sighted)    29.757    -95.365       1
3435    2002-02-28  Monarch Adult (FIRST sighted)    33.834   -118.313       1
3436    2002-03-03  Monarch Adult (FIRST sighted)    28.236    -82.737       1
...            ...                            ...       ...        ...     ...
4775    2002-11-10  Monarch Adult (FIRST sighted)    43.420    -79.250       2
4776    2002-11-11  Monarch Adult (FIRST sighted)    25.884    -80.182       1
4777    2002-11-11  Monarch Adult (FIRST sighted)    29.757    -95.365       1
4778    2002-11-14  Monarch Adult (FIRST sighted)    34.580    -83.584       1
4779    2002-11-28  Monarch Adult (FIRST sighted)    37.904   -122.536       1

[1348 rows x 5 columns]>

In [103]:
JNorth_Adult_First_Site_2002_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2002_df['sighting_date']).month

## January

In [104]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_1_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==1]
JNorth_Adult_First_Site_2002_1_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [105]:
JNorth_Adult_First_Site_2002_1_df.shape

(0, 6)

In [106]:
JNorth_Adult_First_Site_2002_1_df = pd.DataFrame(JNorth_Adult_First_Site_2002_1_df)
JNorth_Adult_First_Site_2002_1_df.drop(['month'], axis=1, inplace=True)

In [107]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_1_df['latitude'] = JNorth_Adult_First_Site_2002_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_1_df['longitude'] = JNorth_Adult_First_Site_2002_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [108]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_1_df, cols)

In [109]:
file = open("JNorth_Adult_First_Site_2002_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [110]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_2_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==2]
JNorth_Adult_First_Site_2002_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
3432,2002-02-23,Monarch Adult (FIRST sighted),29.827,-95.988,1,2
3433,2002-02-26,Monarch Adult (FIRST sighted),33.978,-118.447,1,2
3434,2002-02-27,Monarch Adult (FIRST sighted),29.757,-95.365,1,2
3435,2002-02-28,Monarch Adult (FIRST sighted),33.834,-118.313,1,2

In [111]:
JNorth_Adult_First_Site_2002_2_df.shape

(4, 6)

In [112]:
JNorth_Adult_First_Site_2002_2_df = pd.DataFrame(JNorth_Adult_First_Site_2002_2_df)
JNorth_Adult_First_Site_2002_2_df.drop(['month'], axis=1, inplace=True)

In [113]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_2_df['latitude'] = JNorth_Adult_First_Site_2002_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_2_df['longitude'] = JNorth_Adult_First_Site_2002_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [114]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_2_df, cols)

In [115]:
file = open("JNorth_Adult_First_Site_2002_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [116]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_3_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==3]
JNorth_Adult_First_Site_2002_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
3634,2002-03-31,Monarch Adult (FIRST sighted),33.612,-102.389,1,3
3635,2002-03-31,Monarch Adult (FIRST sighted),33.782,-97.725,1,3
3636,2002-03-31,Monarch Adult (FIRST sighted),35.098,-93.608,1,3
3637,2002-03-31,Monarch Adult (FIRST sighted),35.250,-92.304,1,3
3638,2002-03-31,Monarch Adult (FIRST sighted),35.537,-94.750,1,3

In [117]:
JNorth_Adult_First_Site_2002_3_df.shape

(203, 6)

In [118]:
JNorth_Adult_First_Site_2002_3_df = pd.DataFrame(JNorth_Adult_First_Site_2002_3_df)
JNorth_Adult_First_Site_2002_3_df.drop(['month'], axis=1, inplace=True)

In [119]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_3_df['latitude'] = JNorth_Adult_First_Site_2002_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_3_df['longitude'] = JNorth_Adult_First_Site_2002_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [120]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_3_df, cols)

In [121]:
file = open("JNorth_Adult_First_Site_2002_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [122]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_4_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==4]
JNorth_Adult_First_Site_2002_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
3719,2002-04-28,Monarch Adult (FIRST sighted),35.594,-82.558,1,4
3720,2002-04-28,Monarch Adult (FIRST sighted),36.963,-79.865,1,4
3721,2002-04-29,Monarch Adult (FIRST sighted),33.451,-112.069,1,4
3722,2002-04-29,Monarch Adult (FIRST sighted),42.055,-93.569,1,4
3723,2002-04-30,Monarch Adult (FIRST sighted),28.234,-82.327,1,4

In [123]:
JNorth_Adult_First_Site_2002_4_df.shape

(85, 6)

In [124]:
JNorth_Adult_First_Site_2002_4_df = pd.DataFrame(JNorth_Adult_First_Site_2002_4_df)
JNorth_Adult_First_Site_2002_4_df.drop(['month'], axis=1, inplace=True)

In [125]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_4_df['latitude'] = JNorth_Adult_First_Site_2002_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_4_df['longitude'] = JNorth_Adult_First_Site_2002_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [126]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_4_df, cols)

In [127]:
file = open("JNorth_Adult_First_Site_2002_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [128]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_5_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==5]
JNorth_Adult_First_Site_2002_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
3896,2002-05-31,Monarch Adult (FIRST sighted),45.226,-94.861,1,5
3897,2002-05-31,Monarch Adult (FIRST sighted),45.584,-85.039,1,5
3898,2002-05-31,Monarch Adult (FIRST sighted),45.890,-88.039,1,5
3899,2002-05-31,Monarch Adult (FIRST sighted),46.112,-86.008,1,5
3900,2002-05-31,Monarch Adult (FIRST sighted),48.230,-88.350,1,5

In [129]:
JNorth_Adult_First_Site_2002_5_df.shape

(177, 6)

In [130]:
JNorth_Adult_First_Site_2002_5_df = pd.DataFrame(JNorth_Adult_First_Site_2002_5_df)
JNorth_Adult_First_Site_2002_5_df.drop(['month'], axis=1, inplace=True)

In [131]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_5_df['latitude'] = JNorth_Adult_First_Site_2002_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_5_df['longitude'] = JNorth_Adult_First_Site_2002_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [132]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_5_df, cols)

In [133]:
file = open("JNorth_Adult_First_Site_2002_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [134]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_6_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==6]
JNorth_Adult_First_Site_2002_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
3976,2002-06-25,Monarch Adult (FIRST sighted),44.233,-74.317,1,6
3977,2002-06-26,Monarch Adult (FIRST sighted),38.939,-85.877,1,6
3978,2002-06-26,Monarch Adult (FIRST sighted),39.956,-81.993,1,6
3979,2002-06-29,Monarch Adult (FIRST sighted),39.923,-122.229,1,6
3980,2002-06-30,Monarch Adult (FIRST sighted),48.976,-122.701,1,6

In [135]:
JNorth_Adult_First_Site_2002_6_df.shape

(80, 6)

In [136]:
JNorth_Adult_First_Site_2002_6_df = pd.DataFrame(JNorth_Adult_First_Site_2002_6_df)
JNorth_Adult_First_Site_2002_6_df.drop(['month'], axis=1, inplace=True)

In [137]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_6_df['latitude'] = JNorth_Adult_First_Site_2002_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_6_df['longitude'] = JNorth_Adult_First_Site_2002_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [138]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_6_df, cols)

In [139]:
file = open("JNorth_Adult_First_Site_2002_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [140]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_7_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==7]
JNorth_Adult_First_Site_2002_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
4016,2002-07-28,Monarch Adult (FIRST sighted),34.494,-85.271,2,7
4017,2002-07-28,Monarch Adult (FIRST sighted),40.443,-74.966,1,7
4018,2002-07-30,Monarch Adult (FIRST sighted),41.292,-74.740,1,7
4019,2002-07-31,Monarch Adult (FIRST sighted),39.107,-84.500,1,7
4020,2002-07-31,Monarch Adult (FIRST sighted),43.719,-108.441,1,7

In [141]:
JNorth_Adult_First_Site_2002_7_df.shape

(40, 6)

In [142]:
JNorth_Adult_First_Site_2002_7_df = pd.DataFrame(JNorth_Adult_First_Site_2002_7_df)
JNorth_Adult_First_Site_2002_7_df.drop(['month'], axis=1, inplace=True)

In [143]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_7_df['latitude'] = JNorth_Adult_First_Site_2002_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_7_df['longitude'] = JNorth_Adult_First_Site_2002_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [144]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_7_df, cols)

In [145]:
file = open("JNorth_Adult_First_Site_2002_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [146]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_8_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==8]
JNorth_Adult_First_Site_2002_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
4106,2002-08-31,Monarch Adult (FIRST sighted),39.915,-81.423,1,8
4107,2002-08-31,Monarch Adult (FIRST sighted),41.555,-93.253,1,8
4108,2002-08-31,Monarch Adult (FIRST sighted),44.278,-87.642,1,8
4109,2002-08-31,Monarch Adult (FIRST sighted),46.001,-94.341,1,8
4110,2002-08-31,Monarch Adult (FIRST sighted),48.311,-95.625,1,8

In [147]:
JNorth_Adult_First_Site_2002_8_df.shape

(90, 6)

In [148]:
JNorth_Adult_First_Site_2002_8_df = pd.DataFrame(JNorth_Adult_First_Site_2002_8_df)
JNorth_Adult_First_Site_2002_8_df.drop(['month'], axis=1, inplace=True)

In [149]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_8_df['latitude'] = JNorth_Adult_First_Site_2002_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_8_df['longitude'] = JNorth_Adult_First_Site_2002_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [150]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_8_df, cols)

In [151]:
file = open("JNorth_Adult_First_Site_2002_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [152]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_9_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==9]
JNorth_Adult_First_Site_2002_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
4544,2002-09-30,Monarch Adult (FIRST sighted),41.614,-111.846,1,9
4545,2002-09-30,Monarch Adult (FIRST sighted),41.624,-75.250,1,9
4546,2002-09-30,Monarch Adult (FIRST sighted),42.172,-74.988,1,9
4547,2002-09-30,Monarch Adult (FIRST sighted),42.361,-74.804,1,9
4548,2002-09-30,Monarch Adult (FIRST sighted),43.510,-79.020,1,9

In [153]:
JNorth_Adult_First_Site_2002_9_df.shape

(438, 6)

In [154]:
JNorth_Adult_First_Site_2002_9_df = pd.DataFrame(JNorth_Adult_First_Site_2002_9_df)
JNorth_Adult_First_Site_2002_9_df.drop(['month'], axis=1, inplace=True)

In [155]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_9_df['latitude'] = JNorth_Adult_First_Site_2002_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_9_df['longitude'] = JNorth_Adult_First_Site_2002_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [156]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_9_df, cols)

In [157]:
file = open("JNorth_Adult_First_Site_2002_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [158]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_10_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==10]
JNorth_Adult_First_Site_2002_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
4763,2002-10-29,Monarch Adult (FIRST sighted),30.230,-97.714,1,10
4764,2002-10-30,Monarch Adult (FIRST sighted),25.884,-80.182,1,10
4765,2002-10-30,Monarch Adult (FIRST sighted),29.309,-94.782,1,10
4766,2002-10-30,Monarch Adult (FIRST sighted),31.552,-97.138,1,10
4767,2002-10-31,Monarch Adult (FIRST sighted),28.351,-99.270,1,10

In [159]:
JNorth_Adult_First_Site_2002_10_df.shape

(219, 6)

In [160]:
JNorth_Adult_First_Site_2002_10_df = pd.DataFrame(JNorth_Adult_First_Site_2002_10_df)
JNorth_Adult_First_Site_2002_10_df.drop(['month'], axis=1, inplace=True)

In [161]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_10_df['latitude'] = JNorth_Adult_First_Site_2002_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_10_df['longitude'] = JNorth_Adult_First_Site_2002_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [162]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_10_df, cols)

In [163]:
file = open("JNorth_Adult_First_Site_2002_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [164]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_11_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==11]
JNorth_Adult_First_Site_2002_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
4775,2002-11-10,Monarch Adult (FIRST sighted),43.420,-79.250,2,11
4776,2002-11-11,Monarch Adult (FIRST sighted),25.884,-80.182,1,11
4777,2002-11-11,Monarch Adult (FIRST sighted),29.757,-95.365,1,11
4778,2002-11-14,Monarch Adult (FIRST sighted),34.580,-83.584,1,11
4779,2002-11-28,Monarch Adult (FIRST sighted),37.904,-122.536,1,11

In [165]:
JNorth_Adult_First_Site_2002_11_df.shape

(12, 6)

In [166]:
JNorth_Adult_First_Site_2002_11_df = pd.DataFrame(JNorth_Adult_First_Site_2002_11_df)
JNorth_Adult_First_Site_2002_11_df.drop(['month'], axis=1, inplace=True)

In [167]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_11_df['latitude'] = JNorth_Adult_First_Site_2002_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_11_df['longitude'] = JNorth_Adult_First_Site_2002_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [168]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_11_df, cols)

In [169]:
file = open("JNorth_Adult_First_Site_2002_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [170]:
JNorth_Adult_First_Site_2002_month_df =pd.DataFrame(JNorth_Adult_First_Site_2002_df)
JNorth_Adult_First_Site_2002_12_df = JNorth_Adult_First_Site_2002_month_df[JNorth_Adult_First_Site_2002_month_df['month']==12]
JNorth_Adult_First_Site_2002_12_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [171]:
JNorth_Adult_First_Site_2002_12_df.shape

(0, 6)

In [172]:
JNorth_Adult_First_Site_2002_12_df = pd.DataFrame(JNorth_Adult_First_Site_2002_12_df)
JNorth_Adult_First_Site_2002_12_df.drop(['month'], axis=1, inplace=True)

In [173]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2002_12_df['latitude'] = JNorth_Adult_First_Site_2002_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2002_12_df['longitude'] = JNorth_Adult_First_Site_2002_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [174]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2002_12_df, cols)

In [175]:
file = open("JNorth_Adult_First_Site_2002_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2003

In [176]:
JNorth_Adult_First_Site_2003_df = JNorth_Adult_First_Site_year_df[JNorth_Adult_First_Site_year_df['year']==2003]
JNorth_Adult_First_Site_2003_df.tail()

,sighting_date,species,latitude,longitude,number,year
6151,2003-11-20,Monarch Adult (FIRST sighted),28.529,-96.679,1,2003
6152,2003-11-21,Monarch Adult (FIRST sighted),29.648,-99.224,1,2003
6153,2003-11-22,Monarch Adult (FIRST sighted),29.648,-99.224,1,2003
6154,2003-11-22,Monarch Adult (FIRST sighted),29.757,-95.365,1,2003
6155,2003-11-23,Monarch Adult (FIRST sighted),29.648,-99.224,1,2003

In [177]:
JNorth_Adult_First_Site_2003_df.shape

(1376, 6)

In [178]:
JNorth_Adult_First_Site_2003_df = pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_df.drop(['year'], axis=1, inplace=True)

In [179]:
JNorth_Adult_First_Site_2003_df.tail

<bound method NDFrame.tail of      sighting_date                        species  latitude  longitude  number
4780    2003-01-25  Monarch Adult (FIRST sighted)    33.542   -112.071       1
4781    2003-01-29  Monarch Adult (FIRST sighted)    25.778    -80.198       1
4782    2003-02-01  Monarch Adult (FIRST sighted)    26.456    -82.107       1
4783    2003-02-02  Monarch Adult (FIRST sighted)    25.778    -80.198       1
4784    2003-02-15  Monarch Adult (FIRST sighted)    31.071    -81.418       1
...            ...                            ...       ...        ...     ...
6151    2003-11-20  Monarch Adult (FIRST sighted)    28.529    -96.679       1
6152    2003-11-21  Monarch Adult (FIRST sighted)    29.648    -99.224       1
6153    2003-11-22  Monarch Adult (FIRST sighted)    29.648    -99.224       1
6154    2003-11-22  Monarch Adult (FIRST sighted)    29.757    -95.365       1
6155    2003-11-23  Monarch Adult (FIRST sighted)    29.648    -99.224       1

[1376 rows x 5 columns]>

In [180]:
JNorth_Adult_First_Site_2003_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2003_df['sighting_date']).month

## January

In [181]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_1_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==1]
JNorth_Adult_First_Site_2003_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
4780,2003-01-25,Monarch Adult (FIRST sighted),33.542,-112.071,1,1
4781,2003-01-29,Monarch Adult (FIRST sighted),25.778,-80.198,1,1

In [182]:
JNorth_Adult_First_Site_2003_1_df.shape

(2, 6)

In [183]:
JNorth_Adult_First_Site_2003_1_df = pd.DataFrame(JNorth_Adult_First_Site_2003_1_df)
JNorth_Adult_First_Site_2003_1_df.drop(['month'], axis=1, inplace=True)

In [184]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_1_df['latitude'] = JNorth_Adult_First_Site_2003_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_1_df['longitude'] = JNorth_Adult_First_Site_2003_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [185]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_1_df, cols)

In [186]:
file = open("JNorth_Adult_First_Site_2003_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [187]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_2_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==2]
JNorth_Adult_First_Site_2003_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
4782,2003-02-01,Monarch Adult (FIRST sighted),26.456,-82.107,1,2
4783,2003-02-02,Monarch Adult (FIRST sighted),25.778,-80.198,1,2
4784,2003-02-15,Monarch Adult (FIRST sighted),31.071,-81.418,1,2
4785,2003-02-21,Monarch Adult (FIRST sighted),37.773,-122.410,1,2
4786,2003-02-26,Monarch Adult (FIRST sighted),26.880,-80.050,1,2

In [188]:
JNorth_Adult_First_Site_2003_2_df.shape

(5, 6)

In [189]:
JNorth_Adult_First_Site_2003_2_df = pd.DataFrame(JNorth_Adult_First_Site_2003_2_df)
JNorth_Adult_First_Site_2003_2_df.drop(['month'], axis=1, inplace=True)

In [190]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_2_df['latitude'] = JNorth_Adult_First_Site_2003_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_2_df['longitude'] = JNorth_Adult_First_Site_2003_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [191]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_2_df, cols)

In [192]:
file = open("JNorth_Adult_First_Site_2003_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [193]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_3_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==3]
JNorth_Adult_First_Site_2003_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
4900,2003-03-31,Monarch Adult (FIRST sighted),31.552,-97.138,1,3
4901,2003-03-31,Monarch Adult (FIRST sighted),33.477,-93.918,1,3
4902,2003-03-31,Monarch Adult (FIRST sighted),33.821,-97.780,1,3
4903,2003-03-31,Monarch Adult (FIRST sighted),36.149,-95.976,1,3
4904,2003-03-31,Monarch Adult (FIRST sighted),36.502,-98.503,1,3

In [194]:
JNorth_Adult_First_Site_2003_3_df.shape

(118, 6)

In [195]:
JNorth_Adult_First_Site_2003_3_df = pd.DataFrame(JNorth_Adult_First_Site_2003_3_df)
JNorth_Adult_First_Site_2003_3_df.drop(['month'], axis=1, inplace=True)

In [196]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_3_df['latitude'] = JNorth_Adult_First_Site_2003_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_3_df['longitude'] = JNorth_Adult_First_Site_2003_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [197]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_3_df, cols)

In [198]:
file = open("JNorth_Adult_First_Site_2003_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [199]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_4_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==4]
JNorth_Adult_First_Site_2003_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
4991,2003-04-28,Monarch Adult (FIRST sighted),42.196,-83.624,1,4
4992,2003-04-29,Monarch Adult (FIRST sighted),39.107,-84.500,1,4
4993,2003-04-29,Monarch Adult (FIRST sighted),39.646,-84.167,1,4
4994,2003-04-29,Monarch Adult (FIRST sighted),41.332,-85.021,1,4
4995,2003-04-30,Monarch Adult (FIRST sighted),37.063,-122.162,1,4

In [200]:
JNorth_Adult_First_Site_2003_4_df.shape

(91, 6)

In [201]:
JNorth_Adult_First_Site_2003_4_df =pd.DataFrame(JNorth_Adult_First_Site_2003_4_df)
JNorth_Adult_First_Site_2003_4_df.drop(['month'], axis=1, inplace=True)

In [202]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_4_df['latitude'] = JNorth_Adult_First_Site_2003_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_4_df['longitude'] = JNorth_Adult_First_Site_2003_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [203]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_4_df, cols)

In [204]:
file = open("JNorth_Adult_First_Site_2003_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [205]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_5_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==5]
JNorth_Adult_First_Site_2003_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
5106,2003-05-29,Monarch Adult (FIRST sighted),44.902,-93.288,1,5
5107,2003-05-29,Monarch Adult (FIRST sighted),44.986,-93.270,2,5
5108,2003-05-29,Monarch Adult (FIRST sighted),45.094,-93.004,1,5
5109,2003-05-29,Monarch Adult (FIRST sighted),49.650,-98.330,1,5
5110,2003-05-30,Monarch Adult (FIRST sighted),36.222,-78.438,1,5

In [206]:
JNorth_Adult_First_Site_2003_5_df.shape

(115, 6)

In [207]:
JNorth_Adult_First_Site_2003_5_df =pd.DataFrame(JNorth_Adult_First_Site_2003_5_df)
JNorth_Adult_First_Site_2003_5_df.drop(['month'], axis=1, inplace=True)

In [208]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_5_df['latitude'] = JNorth_Adult_First_Site_2003_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_5_df['longitude'] = JNorth_Adult_First_Site_2003_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [209]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_5_df, cols)

In [210]:
file = open("JNorth_Adult_First_Site_2003_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [211]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_6_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==6]
JNorth_Adult_First_Site_2003_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
5202,2003-06-24,Monarch Adult (FIRST sighted),44.540,-79.220,1,6
5203,2003-06-26,Monarch Adult (FIRST sighted),40.553,-74.288,1,6
5204,2003-06-29,Monarch Adult (FIRST sighted),44.415,-66.492,1,6
5205,2003-06-30,Monarch Adult (FIRST sighted),44.474,-74.278,1,6
5206,2003-06-30,Monarch Adult (FIRST sighted),52.070,-106.380,1,6

In [212]:
JNorth_Adult_First_Site_2003_6_df.shape

(96, 6)

In [213]:
JNorth_Adult_First_Site_2003_6_df = pd.DataFrame(JNorth_Adult_First_Site_2003_6_df)
JNorth_Adult_First_Site_2003_6_df.drop(['month'], axis=1, inplace=True)

In [214]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_6_df['latitude'] = JNorth_Adult_First_Site_2003_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_6_df['longitude'] = JNorth_Adult_First_Site_2003_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [215]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_6_df, cols)

In [216]:
file = open("JNorth_Adult_First_Site_2003_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [217]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_7_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==7]
JNorth_Adult_First_Site_2003_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
5207,2003-07-06,Monarch Adult (FIRST sighted),44.522,-72.363,1,7
5208,2003-07-09,Monarch Adult (FIRST sighted),44.550,-78.430,1,7
5209,2003-07-12,Monarch Adult (FIRST sighted),44.698,-71.931,1,7
5210,2003-07-25,Monarch Adult (FIRST sighted),43.849,-73.768,1,7

In [218]:
JNorth_Adult_First_Site_2003_7_df.shape

(4, 6)

In [219]:
JNorth_Adult_First_Site_2003_7_df = pd.DataFrame(JNorth_Adult_First_Site_2003_7_df)
JNorth_Adult_First_Site_2003_7_df.drop(['month'], axis=1, inplace=True)

In [220]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_7_df['latitude'] = JNorth_Adult_First_Site_2003_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_7_df['longitude'] = JNorth_Adult_First_Site_2003_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [221]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_7_df, cols)

In [222]:
file = open("JNorth_Adult_First_Site_2003_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [223]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_8_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==8]
JNorth_Adult_First_Site_2003_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
5251,2003-08-31,Monarch Adult (FIRST sighted),44.053,-97.516,1,8
5252,2003-08-31,Monarch Adult (FIRST sighted),44.194,-76.104,1,8
5253,2003-08-31,Monarch Adult (FIRST sighted),44.284,-94.190,1,8
5254,2003-08-31,Monarch Adult (FIRST sighted),44.285,-72.491,1,8
5255,2003-08-31,Monarch Adult (FIRST sighted),45.181,-93.578,1,8

In [224]:
JNorth_Adult_First_Site_2003_8_df.shape

(45, 6)

In [225]:
JNorth_Adult_First_Site_2003_8_df = pd.DataFrame(JNorth_Adult_First_Site_2003_8_df)
JNorth_Adult_First_Site_2003_8_df.drop(['month'], axis=1, inplace=True)

In [226]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_8_df['latitude'] = JNorth_Adult_First_Site_2003_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_8_df['longitude'] = JNorth_Adult_First_Site_2003_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [227]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_8_df, cols)

In [228]:
file = open("JNorth_Adult_First_Site_2003_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [229]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_9_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==9]
JNorth_Adult_First_Site_2003_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
5703,2003-09-30,Monarch Adult (FIRST sighted),42.436,-76.502,1,9
5704,2003-09-30,Monarch Adult (FIRST sighted),43.580,-78.100,1,9
5705,2003-09-30,Monarch Adult (FIRST sighted),44.591,-69.343,1,9
5706,2003-09-30,Monarch Adult (FIRST sighted),45.020,-75.240,1,9
5707,2003-09-30,Monarch Adult (FIRST sighted),45.300,-73.360,1,9

In [230]:
JNorth_Adult_First_Site_2003_9_df.shape

(452, 6)

In [231]:
JNorth_Adult_First_Site_2003_9_df = pd.DataFrame(JNorth_Adult_First_Site_2003_9_df)
JNorth_Adult_First_Site_2003_9_df.drop(['month'], axis=1, inplace=True)

In [232]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_9_df['latitude'] = JNorth_Adult_First_Site_2003_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_9_df['longitude'] = JNorth_Adult_First_Site_2003_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [233]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_9_df, cols)

In [234]:
file = open("JNorth_Adult_First_Site_2003_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [235]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_10_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==10]
JNorth_Adult_First_Site_2003_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
6100,2003-10-31,Monarch Adult (FIRST sighted),35.999,-78.898,1,10
6101,2003-10-31,Monarch Adult (FIRST sighted),39.201,-77.621,1,10
6102,2003-10-31,Monarch Adult (FIRST sighted),39.797,-75.148,1,10
6103,2003-10-31,Monarch Adult (FIRST sighted),40.942,-74.661,1,10
6104,2003-10-31,Monarch Adult (FIRST sighted),44.020,-77.440,1,10

In [236]:
JNorth_Adult_First_Site_2003_10_df.shape

(397, 6)

In [237]:
JNorth_Adult_First_Site_2003_10_df = pd.DataFrame(JNorth_Adult_First_Site_2003_10_df)
JNorth_Adult_First_Site_2003_10_df.drop(['month'], axis=1, inplace=True)

In [238]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_10_df['latitude'] = JNorth_Adult_First_Site_2003_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_10_df['longitude'] = JNorth_Adult_First_Site_2003_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [239]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_10_df, cols)

In [240]:
file = open("JNorth_Adult_First_Site_2003_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [241]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_11_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==11]
JNorth_Adult_First_Site_2003_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
6151,2003-11-20,Monarch Adult (FIRST sighted),28.529,-96.679,1,11
6152,2003-11-21,Monarch Adult (FIRST sighted),29.648,-99.224,1,11
6153,2003-11-22,Monarch Adult (FIRST sighted),29.648,-99.224,1,11
6154,2003-11-22,Monarch Adult (FIRST sighted),29.757,-95.365,1,11
6155,2003-11-23,Monarch Adult (FIRST sighted),29.648,-99.224,1,11

In [242]:
JNorth_Adult_First_Site_2003_11_df.shape

(51, 6)

In [243]:
JNorth_Adult_First_Site_2003_11_df = pd.DataFrame(JNorth_Adult_First_Site_2003_11_df)
JNorth_Adult_First_Site_2003_11_df.drop(['month'], axis=1, inplace=True)

In [244]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_11_df['latitude'] = JNorth_Adult_First_Site_2003_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_11_df['longitude'] = JNorth_Adult_First_Site_2003_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [245]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_11_df, cols)

In [246]:
file = open("JNorth_Adult_First_Site_2003_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [247]:
JNorth_Adult_First_Site_2003_month_df =pd.DataFrame(JNorth_Adult_First_Site_2003_df)
JNorth_Adult_First_Site_2003_12_df = JNorth_Adult_First_Site_2003_month_df[JNorth_Adult_First_Site_2003_month_df['month']==12]
JNorth_Adult_First_Site_2003_12_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [248]:
JNorth_Adult_First_Site_2003_12_df.shape

(0, 6)

In [249]:
JNorth_Adult_First_Site_2003_12_df = pd.DataFrame(JNorth_Adult_First_Site_2003_12_df)
JNorth_Adult_First_Site_2003_12_df.drop(['month'], axis=1, inplace=True)

In [250]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2003_12_df['latitude'] = JNorth_Adult_First_Site_2003_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2003_12_df['longitude'] = JNorth_Adult_First_Site_2003_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [251]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2003_12_df, cols)

In [252]:
file = open("JNorth_Adult_First_Site_2003_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2004

In [253]:
JNorth_Adult_First_Site_2004_df = JNorth_Adult_First_Site_year_df[JNorth_Adult_First_Site_year_df['year']==2004]
JNorth_Adult_First_Site_2004_df.tail()

,sighting_date,species,latitude,longitude,number,year
7260,2004-11-23,Monarch Adult (FIRST sighted),29.648,-99.224,1,2004
7261,2004-11-25,Monarch Adult (FIRST sighted),33.028,-97.093,1,2004
7262,2004-11-29,Monarch Adult (FIRST sighted),29.648,-99.224,1,2004
7263,2004-12-06,Monarch Adult (FIRST sighted),29.231,-95.464,1,2004
7264,2004-12-28,Monarch Adult (FIRST sighted),29.554,-98.309,1,2004

In [254]:
JNorth_Adult_First_Site_2004_df.shape

(1109, 6)

In [255]:
JNorth_Adult_First_Site_2004_df = pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_df.drop(['year'], axis=1, inplace=True)

In [256]:
JNorth_Adult_First_Site_2004_df.tail

<bound method NDFrame.tail of      sighting_date                        species  latitude  longitude  number
6156    2004-01-15  Monarch Adult (FIRST sighted)    29.757    -95.365       1
6157    2004-01-18  Monarch Adult (FIRST sighted)    30.226    -93.213       1
6158    2004-01-22  Monarch Adult (FIRST sighted)    26.518    -80.104       1
6159    2004-01-24  Monarch Adult (FIRST sighted)    37.063   -122.162       1
6160    2004-02-01  Monarch Adult (FIRST sighted)    25.778    -80.198       1
...            ...                            ...       ...        ...     ...
7260    2004-11-23  Monarch Adult (FIRST sighted)    29.648    -99.224       1
7261    2004-11-25  Monarch Adult (FIRST sighted)    33.028    -97.093       1
7262    2004-11-29  Monarch Adult (FIRST sighted)    29.648    -99.224       1
7263    2004-12-06  Monarch Adult (FIRST sighted)    29.231    -95.464       1
7264    2004-12-28  Monarch Adult (FIRST sighted)    29.554    -98.309       1

[1109 rows x 5 columns]>

In [257]:
JNorth_Adult_First_Site_2004_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2004_df['sighting_date']).month

## January

In [258]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_1_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==1]
JNorth_Adult_First_Site_2004_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
6156,2004-01-15,Monarch Adult (FIRST sighted),29.757,-95.365,1,1
6157,2004-01-18,Monarch Adult (FIRST sighted),30.226,-93.213,1,1
6158,2004-01-22,Monarch Adult (FIRST sighted),26.518,-80.104,1,1
6159,2004-01-24,Monarch Adult (FIRST sighted),37.063,-122.162,1,1

In [259]:
JNorth_Adult_First_Site_2004_1_df.shape

(4, 6)

In [260]:
JNorth_Adult_First_Site_2004_1_df = pd.DataFrame(JNorth_Adult_First_Site_2004_1_df)
JNorth_Adult_First_Site_2004_1_df.drop(['month'], axis=1, inplace=True)

In [261]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_1_df['latitude'] = JNorth_Adult_First_Site_2004_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_1_df['longitude'] = JNorth_Adult_First_Site_2004_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [262]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_1_df, cols)

In [263]:
file = open("JNorth_Adult_First_Site_2004_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [264]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_2_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==2]
JNorth_Adult_First_Site_2004_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
6163,2004-02-08,Monarch Adult (FIRST sighted),26.441,-81.810,1,2
6164,2004-02-11,Monarch Adult (FIRST sighted),28.029,-80.608,1,2
6165,2004-02-13,Monarch Adult (FIRST sighted),26.838,-82.209,1,2
6166,2004-02-22,Monarch Adult (FIRST sighted),30.388,-87.059,1,2
6167,2004-02-23,Monarch Adult (FIRST sighted),28.210,-82.289,1,2

In [265]:
JNorth_Adult_First_Site_2004_2_df.shape

(8, 6)

In [266]:
JNorth_Adult_First_Site_2004_2_df = pd.DataFrame(JNorth_Adult_First_Site_2004_2_df)
JNorth_Adult_First_Site_2004_2_df.drop(['month'], axis=1, inplace=True)

In [267]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_2_df['latitude'] = JNorth_Adult_First_Site_2004_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_2_df['longitude'] = JNorth_Adult_First_Site_2004_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [268]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_2_df, cols)

In [269]:
file = open("JNorth_Adult_First_Site_2004_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [270]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_3_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==3]
JNorth_Adult_First_Site_2004_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
6243,2004-03-31,Monarch Adult (FIRST sighted),29.732,-99.974,1,3
6244,2004-03-31,Monarch Adult (FIRST sighted),29.757,-95.365,1,3
6245,2004-03-31,Monarch Adult (FIRST sighted),29.855,-97.959,1,3
6246,2004-03-31,Monarch Adult (FIRST sighted),30.059,-98.146,1,3
6247,2004-03-31,Monarch Adult (FIRST sighted),32.386,-100.004,1,3

In [271]:
JNorth_Adult_First_Site_2004_3_df.shape

(80, 6)

In [272]:
JNorth_Adult_First_Site_2004_3_df = pd.DataFrame(JNorth_Adult_First_Site_2004_3_df)
JNorth_Adult_First_Site_2004_3_df.drop(['month'], axis=1, inplace=True)

In [273]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_3_df['latitude'] = JNorth_Adult_First_Site_2004_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_3_df['longitude'] = JNorth_Adult_First_Site_2004_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [274]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_3_df, cols)

In [275]:
file = open("JNorth_Adult_First_Site_2004_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [276]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_4_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==4]
JNorth_Adult_First_Site_2004_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
6311,2004-04-28,Monarch Adult (FIRST sighted),33.580,-91.792,1,4
6312,2004-04-28,Monarch Adult (FIRST sighted),37.686,-97.335,1,4
6313,2004-04-30,Monarch Adult (FIRST sighted),31.186,-83.746,1,4
6314,2004-04-30,Monarch Adult (FIRST sighted),34.592,-94.190,1,4
6315,2004-04-30,Monarch Adult (FIRST sighted),39.977,-75.312,1,4

In [277]:
JNorth_Adult_First_Site_2004_4_df.shape

(68, 6)

In [278]:
JNorth_Adult_First_Site_2004_4_df = pd.DataFrame(JNorth_Adult_First_Site_2004_4_df)
JNorth_Adult_First_Site_2004_4_df.drop(['month'], axis=1, inplace=True)

In [279]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_4_df['latitude'] = JNorth_Adult_First_Site_2004_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_4_df['longitude'] = JNorth_Adult_First_Site_2004_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [280]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_4_df, cols)

In [281]:
file = open("JNorth_Adult_First_Site_2004_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [282]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_5_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==5]
JNorth_Adult_First_Site_2004_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
6420,2004-05-30,Monarch Adult (FIRST sighted),44.300,-80.100,1,5
6421,2004-05-30,Monarch Adult (FIRST sighted),45.107,-93.490,1,5
6422,2004-05-30,Monarch Adult (FIRST sighted),46.154,-85.338,1,5
6423,2004-05-31,Monarch Adult (FIRST sighted),42.940,-71.531,1,5
6424,2004-05-31,Monarch Adult (FIRST sighted),43.061,-85.850,1,5

In [283]:
JNorth_Adult_First_Site_2004_5_df.shape

(109, 6)

In [284]:
JNorth_Adult_First_Site_2004_5_df = pd.DataFrame(JNorth_Adult_First_Site_2004_5_df)
JNorth_Adult_First_Site_2004_5_df.drop(['month'], axis=1, inplace=True)

In [285]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_5_df['latitude'] = JNorth_Adult_First_Site_2004_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_5_df['longitude'] = JNorth_Adult_First_Site_2004_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [286]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_5_df, cols)

In [287]:
file = open("JNorth_Adult_First_Site_2004_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [288]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_6_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==6]
JNorth_Adult_First_Site_2004_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
6515,2004-06-26,Monarch Adult (FIRST sighted),43.420,-79.250,1,6
6516,2004-06-26,Monarch Adult (FIRST sighted),43.903,-69.980,1,6
6517,2004-06-28,Monarch Adult (FIRST sighted),47.210,-84.380,1,6
6518,2004-06-29,Monarch Adult (FIRST sighted),41.870,-87.814,1,6
6519,2004-06-30,Monarch Adult (FIRST sighted),40.727,-74.590,1,6

In [289]:
JNorth_Adult_First_Site_2004_6_df.shape

(95, 6)

In [290]:
JNorth_Adult_First_Site_2004_6_df = pd.DataFrame(JNorth_Adult_First_Site_2004_6_df)
JNorth_Adult_First_Site_2004_6_df.drop(['month'], axis=1, inplace=True)

In [291]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_6_df['latitude'] = JNorth_Adult_First_Site_2004_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_6_df['longitude'] = JNorth_Adult_First_Site_2004_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [292]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_6_df, cols)

In [293]:
file = open("JNorth_Adult_First_Site_2004_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [294]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_7_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==7]
JNorth_Adult_First_Site_2004_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
6530,2004-07-19,Monarch Adult (FIRST sighted),40.055,-86.170,1,7
6531,2004-07-25,Monarch Adult (FIRST sighted),40.328,-75.993,1,7
6532,2004-07-25,Monarch Adult (FIRST sighted),44.906,-93.339,2,7
6533,2004-07-26,Monarch Adult (FIRST sighted),27.797,-97.399,1,7
6534,2004-07-27,Monarch Adult (FIRST sighted),39.353,-120.190,1,7

In [295]:
JNorth_Adult_First_Site_2004_7_df.shape

(15, 6)

In [296]:
JNorth_Adult_First_Site_2004_7_df = pd.DataFrame(JNorth_Adult_First_Site_2004_7_df)
JNorth_Adult_First_Site_2004_7_df.drop(['month'], axis=1, inplace=True)

In [297]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_7_df['latitude'] = JNorth_Adult_First_Site_2004_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_7_df['longitude'] = JNorth_Adult_First_Site_2004_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [298]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_7_df, cols)

In [299]:
file = open("JNorth_Adult_First_Site_2004_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [300]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_8_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==8]
JNorth_Adult_First_Site_2004_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
6583,2004-08-31,Monarch Adult (FIRST sighted),35.723,-83.494,1,8
6584,2004-08-31,Monarch Adult (FIRST sighted),38.996,-76.748,1,8
6585,2004-08-31,Monarch Adult (FIRST sighted),43.061,-85.850,1,8
6586,2004-08-31,Monarch Adult (FIRST sighted),43.417,-71.990,1,8
6587,2004-08-31,Monarch Adult (FIRST sighted),45.186,-93.581,1,8

In [301]:
JNorth_Adult_First_Site_2004_8_df.shape

(53, 6)

In [302]:
JNorth_Adult_First_Site_2004_8_df= pd.DataFrame(JNorth_Adult_First_Site_2004_8_df)
JNorth_Adult_First_Site_2004_8_df.drop(['month'], axis=1, inplace=True)

In [303]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_8_df['latitude'] = JNorth_Adult_First_Site_2004_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_8_df['longitude'] = JNorth_Adult_First_Site_2004_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [304]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_8_df, cols)

In [305]:
file = open("JNorth_Adult_First_Site_2004_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [306]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_9_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==9]
JNorth_Adult_First_Site_2004_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
6860,2004-09-30,Monarch Adult (FIRST sighted),38.360,-81.686,1,9
6861,2004-09-30,Monarch Adult (FIRST sighted),38.788,-82.916,1,9
6862,2004-09-30,Monarch Adult (FIRST sighted),42.539,-82.949,1,9
6863,2004-09-30,Monarch Adult (FIRST sighted),42.590,-81.140,1,9
6864,2004-09-30,Monarch Adult (FIRST sighted),43.871,-72.828,1,9

In [307]:
JNorth_Adult_First_Site_2004_9_df.shape

(277, 6)

In [308]:
JNorth_Adult_First_Site_2004_9_df = pd.DataFrame(JNorth_Adult_First_Site_2004_9_df)
JNorth_Adult_First_Site_2004_9_df.drop(['month'], axis=1, inplace=True)

In [309]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_9_df['latitude'] = JNorth_Adult_First_Site_2004_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_9_df['longitude'] = JNorth_Adult_First_Site_2004_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [310]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_9_df, cols)

In [311]:
file = open("JNorth_Adult_First_Site_2004_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [312]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_10_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==10]
JNorth_Adult_First_Site_2004_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
7209,2004-10-31,Monarch Adult (FIRST sighted),38.882,-94.818,1,10
7210,2004-10-31,Monarch Adult (FIRST sighted),38.980,-77.380,1,10
7211,2004-10-31,Monarch Adult (FIRST sighted),38.996,-76.748,1,10
7212,2004-10-31,Monarch Adult (FIRST sighted),39.201,-77.621,1,10
7213,2004-10-31,Monarch Adult (FIRST sighted),41.176,-73.281,1,10

In [313]:
JNorth_Adult_First_Site_2004_10_df.shape

(349, 6)

In [314]:
JNorth_Adult_First_Site_2004_10_df = pd.DataFrame(JNorth_Adult_First_Site_2004_10_df)
JNorth_Adult_First_Site_2004_10_df.drop(['month'], axis=1, inplace=True)

In [315]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_10_df['latitude'] = JNorth_Adult_First_Site_2004_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_10_df['longitude'] = JNorth_Adult_First_Site_2004_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [316]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_10_df, cols)

In [317]:
file = open("JNorth_Adult_First_Site_2004_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [318]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_11_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==11]
JNorth_Adult_First_Site_2004_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
7258,2004-11-21,Monarch Adult (FIRST sighted),29.648,-99.224,1,11
7259,2004-11-22,Monarch Adult (FIRST sighted),29.648,-99.224,1,11
7260,2004-11-23,Monarch Adult (FIRST sighted),29.648,-99.224,1,11
7261,2004-11-25,Monarch Adult (FIRST sighted),33.028,-97.093,1,11
7262,2004-11-29,Monarch Adult (FIRST sighted),29.648,-99.224,1,11

In [319]:
JNorth_Adult_First_Site_2004_11_df.shape

(49, 6)

In [320]:
JNorth_Adult_First_Site_2004_11_df = pd.DataFrame(JNorth_Adult_First_Site_2004_11_df)
JNorth_Adult_First_Site_2004_11_df.drop(['month'], axis=1, inplace=True)

In [321]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_11_df['latitude'] = JNorth_Adult_First_Site_2004_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_11_df['longitude'] = JNorth_Adult_First_Site_2004_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [322]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_11_df, cols)

In [323]:
file = open("JNorth_Adult_First_Site_2004_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [324]:
JNorth_Adult_First_Site_2004_month_df =pd.DataFrame(JNorth_Adult_First_Site_2004_df)
JNorth_Adult_First_Site_2004_12_df = JNorth_Adult_First_Site_2004_month_df[JNorth_Adult_First_Site_2004_month_df['month']==12]
JNorth_Adult_First_Site_2004_12_df.tail()

,sighting_date,species,latitude,longitude,number,month
7263,2004-12-06,Monarch Adult (FIRST sighted),29.231,-95.464,1,12
7264,2004-12-28,Monarch Adult (FIRST sighted),29.554,-98.309,1,12

In [325]:
JNorth_Adult_First_Site_2004_12_df.shape

(2, 6)

In [326]:
JNorth_Adult_First_Site_2004_12_df = pd.DataFrame(JNorth_Adult_First_Site_2004_12_df)
JNorth_Adult_First_Site_2004_12_df.drop(['month'], axis=1, inplace=True)

In [327]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2004_12_df['latitude'] = JNorth_Adult_First_Site_2004_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2004_12_df['longitude'] = JNorth_Adult_First_Site_2004_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [328]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2004_12_df, cols)

In [329]:
file = open("JNorth_Adult_First_Site_2004_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2005

In [330]:
JNorth_Adult_First_Site_2005_df = JNorth_Adult_First_Site_df[JNorth_Adult_First_Site_df['year']==2005]
JNorth_Adult_First_Site_2005_df.tail()

,sighting_date,species,latitude,longitude,number,year
8728,2005-11-18,Monarch Adult (FIRST sighted),29.309,-94.782,1,2005
8729,2005-11-26,Monarch Adult (FIRST sighted),30.061,-95.384,1,2005
8730,2005-11-26,Monarch Adult (FIRST sighted),30.076,-95.638,1,2005
8731,2005-12-02,Monarch Adult (FIRST sighted),28.807,-96.979,1,2005
8732,2005-12-05,Monarch Adult (FIRST sighted),28.210,-82.289,1,2005

In [331]:
JNorth_Adult_First_Site_2005_df.shape

(1468, 6)

In [332]:
JNorth_Adult_First_Site_2005_df = pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_df.drop(['year'], axis=1, inplace=True)

In [333]:
JNorth_Adult_First_Site_2005_df.tail

<bound method NDFrame.tail of      sighting_date                        species  latitude  longitude  number
7265    2005-01-11  Monarch Adult (FIRST sighted)    26.575    -81.947       1
7266    2005-01-17  Monarch Adult (FIRST sighted)    28.542    -81.374       1
7267    2005-01-22  Monarch Adult (FIRST sighted)    26.125    -81.792       1
7268    2005-02-13  Monarch Adult (FIRST sighted)    29.821    -98.751       1
7269    2005-02-15  Monarch Adult (FIRST sighted)    29.732    -99.974       1
...            ...                            ...       ...        ...     ...
8728    2005-11-18  Monarch Adult (FIRST sighted)    29.309    -94.782       1
8729    2005-11-26  Monarch Adult (FIRST sighted)    30.061    -95.384       1
8730    2005-11-26  Monarch Adult (FIRST sighted)    30.076    -95.638       1
8731    2005-12-02  Monarch Adult (FIRST sighted)    28.807    -96.979       1
8732    2005-12-05  Monarch Adult (FIRST sighted)    28.210    -82.289       1

[1468 rows x 5 columns]>

In [334]:
JNorth_Adult_First_Site_2005_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2005_df['sighting_date']).month

## January

In [335]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_1_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==1]
JNorth_Adult_First_Site_2005_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
7265,2005-01-11,Monarch Adult (FIRST sighted),26.575,-81.947,1,1
7266,2005-01-17,Monarch Adult (FIRST sighted),28.542,-81.374,1,1
7267,2005-01-22,Monarch Adult (FIRST sighted),26.125,-81.792,1,1

In [336]:
JNorth_Adult_First_Site_2005_1_df.shape

(3, 6)

In [337]:
JNorth_Adult_First_Site_2005_1_df = pd.DataFrame(JNorth_Adult_First_Site_2005_1_df)
JNorth_Adult_First_Site_2005_1_df.drop(['month'], axis=1, inplace=True)

In [338]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_1_df['latitude'] = JNorth_Adult_First_Site_2005_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_1_df['longitude'] = JNorth_Adult_First_Site_2005_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [339]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_1_df, cols)

In [340]:
file = open("JNorth_Adult_First_Site_2005_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# February

In [341]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_2_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==2]
JNorth_Adult_First_Site_2005_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
7269,2005-02-15,Monarch Adult (FIRST sighted),29.732,-99.974,1,2
7270,2005-02-16,Monarch Adult (FIRST sighted),30.340,-81.831,1,2
7271,2005-02-20,Monarch Adult (FIRST sighted),29.757,-95.365,1,2
7272,2005-02-21,Monarch Adult (FIRST sighted),26.938,-80.812,1,2
7273,2005-02-22,Monarch Adult (FIRST sighted),29.757,-95.365,1,2

In [342]:
JNorth_Adult_First_Site_2005_2_df.shape

(6, 6)

In [343]:
JNorth_Adult_First_Site_2005_2_df = pd.DataFrame(JNorth_Adult_First_Site_2005_2_df)
JNorth_Adult_First_Site_2005_2_df.drop(['month'], axis=1, inplace=True)

In [344]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_2_df['latitude'] = JNorth_Adult_First_Site_2005_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_2_df['longitude'] = JNorth_Adult_First_Site_2005_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [345]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_2_df, cols)

In [346]:
file = open("JNorth_Adult_First_Site_2005_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# March

In [347]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_3_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==3]
JNorth_Adult_First_Site_2005_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
7346,2005-03-31,Monarch Adult (FIRST sighted),32.733,-96.451,1,3
7347,2005-03-31,Monarch Adult (FIRST sighted),32.788,-96.800,1,3
7348,2005-03-31,Monarch Adult (FIRST sighted),32.934,-94.957,1,3
7349,2005-03-31,Monarch Adult (FIRST sighted),33.285,-91.020,1,3
7350,2005-03-31,Monarch Adult (FIRST sighted),33.580,-91.792,1,3

In [348]:
JNorth_Adult_First_Site_2005_3_df.shape

(77, 6)

In [349]:
JNorth_Adult_First_Site_2005_3_df = pd.DataFrame(JNorth_Adult_First_Site_2005_3_df)
JNorth_Adult_First_Site_2005_3_df.drop(['month'], axis=1, inplace=True)

In [350]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_3_df['latitude'] = JNorth_Adult_First_Site_2005_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_3_df['longitude'] = JNorth_Adult_First_Site_2005_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [351]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_3_df, cols)

In [352]:
file = open("JNorth_Adult_First_Site_2005_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# April

In [353]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_4_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==4]
JNorth_Adult_First_Site_2005_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
7443,2005-04-28,Monarch Adult (FIRST sighted),34.198,-79.827,1,4
7444,2005-04-28,Monarch Adult (FIRST sighted),36.164,-86.774,1,4
7445,2005-04-28,Monarch Adult (FIRST sighted),39.276,-75.531,1,4
7446,2005-04-28,Monarch Adult (FIRST sighted),39.416,-95.778,1,4
7447,2005-04-28,Monarch Adult (FIRST sighted),39.864,-86.380,1,4

In [354]:
JNorth_Adult_First_Site_2005_4_df.shape

(97, 6)

In [355]:
JNorth_Adult_First_Site_2005_4_df= pd.DataFrame(JNorth_Adult_First_Site_2005_4_df)
JNorth_Adult_First_Site_2005_4_df.drop(['month'], axis=1, inplace=True)

In [356]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_4_df['latitude'] = JNorth_Adult_First_Site_2005_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_4_df['longitude'] = JNorth_Adult_First_Site_2005_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [357]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_4_df, cols)

In [358]:
file = open("JNorth_Adult_First_Site_2005_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# May

In [359]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_5_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==5]
JNorth_Adult_First_Site_2005_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
7546,2005-05-31,Monarch Adult (FIRST sighted),41.332,-85.021,1,5
7547,2005-05-31,Monarch Adult (FIRST sighted),42.992,-85.058,1,5
7548,2005-05-31,Monarch Adult (FIRST sighted),44.966,-93.084,1,5
7549,2005-05-31,Monarch Adult (FIRST sighted),46.160,-79.180,1,5
7550,2005-05-31,Monarch Adult (FIRST sighted),46.283,-96.098,1,5

In [360]:
JNorth_Adult_First_Site_2005_5_df.shape

(103, 6)

In [361]:
JNorth_Adult_First_Site_2005_5_df = pd.DataFrame(JNorth_Adult_First_Site_2005_5_df)
JNorth_Adult_First_Site_2005_5_df.drop(['month'], axis=1, inplace=True)

In [362]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_5_df['latitude'] = JNorth_Adult_First_Site_2005_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_5_df['longitude'] = JNorth_Adult_First_Site_2005_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [363]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_5_df, cols)

In [364]:
file = open("JNorth_Adult_First_Site_2005_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# June

In [365]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_6_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==6]
JNorth_Adult_First_Site_2005_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
7724,2005-06-27,Monarch Adult (FIRST sighted),53.380,-113.380,1,6
7725,2005-06-28,Monarch Adult (FIRST sighted),41.233,-77.501,1,6
7726,2005-06-28,Monarch Adult (FIRST sighted),45.030,-78.310,2,6
7727,2005-06-29,Monarch Adult (FIRST sighted),42.909,-78.750,1,6
7728,2005-06-30,Monarch Adult (FIRST sighted),43.079,-89.377,1,6

In [366]:
JNorth_Adult_First_Site_2005_6_df.shape

(178, 6)

In [367]:
JNorth_Adult_First_Site_2005_6_df = pd.DataFrame(JNorth_Adult_First_Site_2005_6_df)
JNorth_Adult_First_Site_2005_6_df.drop(['month'], axis=1, inplace=True)

In [368]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_6_df['latitude'] = JNorth_Adult_First_Site_2005_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_6_df['longitude'] = JNorth_Adult_First_Site_2005_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [369]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_6_df, cols)

In [370]:
file = open("JNorth_Adult_First_Site_2005_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# July

In [371]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_7_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==7]
JNorth_Adult_First_Site_2005_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
7760,2005-07-27,Monarch Adult (FIRST sighted),44.338,-75.920,1,7
7761,2005-07-28,Monarch Adult (FIRST sighted),35.137,-77.006,1,7
7762,2005-07-30,Monarch Adult (FIRST sighted),37.954,-121.439,1,7
7763,2005-07-31,Monarch Adult (FIRST sighted),34.860,-92.400,1,7
7764,2005-07-31,Monarch Adult (FIRST sighted),37.538,-77.436,1,7

In [372]:
JNorth_Adult_First_Site_2005_7_df.shape

(36, 6)

In [373]:
JNorth_Adult_First_Site_2005_7_df = pd.DataFrame(JNorth_Adult_First_Site_2005_7_df)
JNorth_Adult_First_Site_2005_7_df.drop(['month'], axis=1, inplace=True)

In [374]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_7_df['latitude'] = JNorth_Adult_First_Site_2005_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_7_df['longitude'] = JNorth_Adult_First_Site_2005_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [375]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_7_df, cols)

In [376]:
file = open("JNorth_Adult_First_Site_2005_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# August

In [377]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_8_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==8]
JNorth_Adult_First_Site_2005_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
7887,2005-08-31,Monarch Adult (FIRST sighted),41.555,-93.253,1,8
7888,2005-08-31,Monarch Adult (FIRST sighted),41.606,-87.496,1,8
7889,2005-08-31,Monarch Adult (FIRST sighted),43.060,-94.236,1,8
7890,2005-08-31,Monarch Adult (FIRST sighted),43.363,-92.168,1,8
7891,2005-08-31,Monarch Adult (FIRST sighted),43.463,-83.710,1,8

In [378]:
JNorth_Adult_First_Site_2005_8_df.shape

(127, 6)

In [379]:
JNorth_Adult_First_Site_2005_8_df = pd.DataFrame(JNorth_Adult_First_Site_2005_8_df)
JNorth_Adult_First_Site_2005_8_df.drop(['month'], axis=1, inplace=True)

In [380]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_8_df['latitude'] = JNorth_Adult_First_Site_2005_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_8_df['longitude'] = JNorth_Adult_First_Site_2005_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [381]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_8_df, cols)

In [382]:
file = open("JNorth_Adult_First_Site_2005_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# September

In [383]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_9_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==9]
JNorth_Adult_First_Site_2005_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
8341,2005-09-30,Monarch Adult (FIRST sighted),40.125,-75.545,1,9
8342,2005-09-30,Monarch Adult (FIRST sighted),41.756,-72.764,1,9
8343,2005-09-30,Monarch Adult (FIRST sighted),41.762,-88.659,2,9
8344,2005-09-30,Monarch Adult (FIRST sighted),44.591,-69.343,1,9
8345,2005-09-30,Monarch Adult (FIRST sighted),45.186,-93.581,1,9

In [384]:
JNorth_Adult_First_Site_2005_9_df.shape

(454, 6)

In [385]:
JNorth_Adult_First_Site_2005_9_df = pd.DataFrame(JNorth_Adult_First_Site_2005_9_df)
JNorth_Adult_First_Site_2005_9_df.drop(['month'], axis=1, inplace=True)

In [386]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_9_df['latitude'] = JNorth_Adult_First_Site_2005_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_9_df['longitude'] = JNorth_Adult_First_Site_2005_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [387]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_9_df, cols)

In [388]:
file = open("JNorth_Adult_First_Site_2005_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# October

In [389]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_10_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==10]
JNorth_Adult_First_Site_2005_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
8690,2005-10-30,Monarch Adult (FIRST sighted),45.035,-73.146,1,10
8691,2005-10-31,Monarch Adult (FIRST sighted),25.170,-76.230,1,10
8692,2005-10-31,Monarch Adult (FIRST sighted),27.090,-80.532,1,10
8693,2005-10-31,Monarch Adult (FIRST sighted),33.794,-83.362,1,10
8694,2005-10-31,Monarch Adult (FIRST sighted),39.068,-78.195,1,10

In [390]:
JNorth_Adult_First_Site_2005_10_df.shape

(349, 6)

In [391]:
JNorth_Adult_First_Site_2005_10_df = pd.DataFrame(JNorth_Adult_First_Site_2005_10_df)
JNorth_Adult_First_Site_2005_10_df.drop(['month'], axis=1, inplace=True)

In [392]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_10_df['latitude'] = JNorth_Adult_First_Site_2005_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_10_df['longitude'] = JNorth_Adult_First_Site_2005_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [393]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_10_df, cols)

In [394]:
file = open("JNorth_Adult_First_Site_2005_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# November

In [395]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_11_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==11]
JNorth_Adult_First_Site_2005_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
8726,2005-11-14,Monarch Adult (FIRST sighted),29.648,-99.224,1,11
8727,2005-11-15,Monarch Adult (FIRST sighted),17.250,-88.000,1,11
8728,2005-11-18,Monarch Adult (FIRST sighted),29.309,-94.782,1,11
8729,2005-11-26,Monarch Adult (FIRST sighted),30.061,-95.384,1,11
8730,2005-11-26,Monarch Adult (FIRST sighted),30.076,-95.638,1,11

In [396]:
JNorth_Adult_First_Site_2005_11_df.shape

(36, 6)

In [397]:
JNorth_Adult_First_Site_2005_11_df = pd.DataFrame(JNorth_Adult_First_Site_2005_11_df)
JNorth_Adult_First_Site_2005_11_df.drop(['month'], axis=1, inplace=True)

In [398]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_11_df['latitude'] = JNorth_Adult_First_Site_2005_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_11_df['longitude'] = JNorth_Adult_First_Site_2005_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [399]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_11_df, cols)

In [400]:
file = open("JNorth_Adult_First_Site_2005_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# December

In [401]:
JNorth_Adult_First_Site_2005_month_df =pd.DataFrame(JNorth_Adult_First_Site_2005_df)
JNorth_Adult_First_Site_2005_12_df = JNorth_Adult_First_Site_2005_month_df[JNorth_Adult_First_Site_2005_month_df['month']==12]
JNorth_Adult_First_Site_2005_12_df.tail()

,sighting_date,species,latitude,longitude,number,month
8731,2005-12-02,Monarch Adult (FIRST sighted),28.807,-96.979,1,12
8732,2005-12-05,Monarch Adult (FIRST sighted),28.210,-82.289,1,12

In [402]:
JNorth_Adult_First_Site_2005_12_df.shape

(2, 6)

In [403]:
JNorth_Adult_First_Site_2005_12_df = pd.DataFrame(JNorth_Adult_First_Site_2005_12_df)
JNorth_Adult_First_Site_2005_12_df.drop(['month'], axis=1, inplace=True)

In [404]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2005_12_df['latitude'] = JNorth_Adult_First_Site_2005_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2005_12_df['longitude'] = JNorth_Adult_First_Site_2005_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [405]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2005_12_df, cols)

In [406]:
file = open("JNorth_Adult_First_Site_2005_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()